ruby/T.org
#+TITLE:     T
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>



* [[https://wordsinasentence.com/tacit-in-a-sentence/][Tacit]]

  =implied but not directly stated=

  - Although no words were spoken, our nods represented our tacit agreement to a cease fire.
  - In my business, all that is needed for a tacit understanding is a handshake between men.
  - Even though my boyfriend and I have only been dating for three months, we have a tacit understanding to not date other people.
  - In order to take the school field trip, you will need more than your parent’s tacit consent.
  - Although the world leaders have not signed the treaty yet, they have made a tacit pact on nuclear disarmament.
  - The police always have the tacit understanding they can do whatever it takes to protect the lives of the public.
  - During the minister’s speech, I found myself nodding in tacit support.

