ruby/T.html
<!DOCTYPE html>
<html>
<head>
<title>T</title>
<!-- 2018-05-24 Thu 08:40 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">T</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tacit</a></li>
<li><a href="#sec-2">2. Tactile</a></li>
<li><a href="#sec-3">3. Tangential</a></li>
<li><a href="#sec-4">4. Tangle</a></li>
<li><a href="#sec-5">5. Tantalize</a></li>
<li><a href="#sec-6">6. Tantamount</a></li>
<li><a href="#sec-7">7. Taper</a></li>
<li><a href="#sec-8">8. Tardy</a></li>
<li><a href="#sec-9">9. Tarnish</a></li>
<li><a href="#sec-10">10. Taunt</a></li>
<li><a href="#sec-11">11. Taut</a></li>
<li><a href="#sec-12">12. Tawdry</a></li>
<li><a href="#sec-13">13. Taxing</a></li>
<li><a href="#sec-14">14. Tedium</a></li>
<li><a href="#sec-15">15. Teem</a></li>
<li><a href="#sec-16">16. Temperate</a></li>
<li><a href="#sec-17">17. Temporal</a></li>
<li><a href="#sec-18">18. Tenable</a></li>
<li><a href="#sec-19">19. Tenacious</a></li>
<li><a href="#sec-20">20. Tenacity</a></li>
<li><a href="#sec-21">21. Tendentious</a></li>
<li><a href="#sec-22">22. Tenet</a></li>
<li><a href="#sec-23">23. Tenuous</a></li>
<li><a href="#sec-24">24. Tepid</a></li>
<li><a href="#sec-25">25. Terse</a></li>
<li><a href="#sec-26">26. Thatch</a></li>
<li><a href="#sec-27">27. Theatrical</a></li>
<li><a href="#sec-28">28. Thematic</a></li>
<li><a href="#sec-29">29. Therapeutic</a></li>
<li><a href="#sec-30">30. Thwart</a></li>
<li><a href="#sec-31">31. Timorous</a></li>
<li><a href="#sec-32">32. Titular</a></li>
<li><a href="#sec-33">33. Toady</a></li>
<li><a href="#sec-34">34. Topple</a></li>
<li><a href="#sec-35">35. Torpid</a></li>
<li><a href="#sec-36">36. Torpor</a></li>
<li><a href="#sec-37">37. Tortuous</a></li>
<li><a href="#sec-38">38. Totalitarian</a></li>
<li><a href="#sec-39">39. Tout</a></li>
<li><a href="#sec-40">40. Tractable</a></li>
<li><a href="#sec-41">41. Trait</a></li>
<li><a href="#sec-42">42. Trample</a></li>
<li><a href="#sec-43">43. Tranquil</a></li>
<li><a href="#sec-44">44. Transcend</a></li>
<li><a href="#sec-45">45. Transcendent</a></li>
<li><a href="#sec-46">46. Transcribe</a></li>
<li><a href="#sec-47">47. Transcription</a></li>
<li><a href="#sec-48">48. Transgress</a></li>
<li><a href="#sec-49">49. Transitory</a></li>
<li><a href="#sec-50">50. Transmute</a></li>
<li><a href="#sec-51">51. Treacherous</a></li>
<li><a href="#sec-52">52. Tread</a></li>
<li><a href="#sec-53">53. Treatise</a></li>
<li><a href="#sec-54">54. Trenchant</a></li>
<li><a href="#sec-55">55. Trepidation</a></li>
<li><a href="#sec-56">56. Trespass</a></li>
<li><a href="#sec-57">57. Tribulation</a></li>
<li><a href="#sec-58">58. Tributary</a></li>
<li><a href="#sec-59">59. Trickle</a></li>
<li><a href="#sec-60">60. Trilogy</a></li>
<li><a href="#sec-61">61. Trite</a></li>
<li><a href="#sec-62">62. Truce</a></li>
<li><a href="#sec-63">63. Truculent</a></li>
<li><a href="#sec-64">64. Turbulent</a></li>
<li><a href="#sec-65">65. Turmoil</a></li>
<li><a href="#sec-66">66. Tyrant</a></li>
<li><a href="#sec-67">67. Taciturn</a></li>
<li><a href="#sec-68">68. Tally</a></li>
<li><a href="#sec-69">69. Tame</a></li>
<li><a href="#sec-70">70. Tantrum</a></li>
<li><a href="#sec-71">71. Tarry</a></li>
<li><a href="#sec-72">72. Tart</a></li>
<li><a href="#sec-73">73. Teeter</a></li>
<li><a href="#sec-74">74. Temerity</a></li>
<li><a href="#sec-75">75. Tempest</a></li>
<li><a href="#sec-76">76. Tempestuous</a></li>
<li><a href="#sec-77">77. Temporize</a></li>
<li><a href="#sec-78">78. Testy</a></li>
<li><a href="#sec-79">79. Thaw</a></li>
<li><a href="#sec-80">80. Thermal</a></li>
<li><a href="#sec-81">81. Thespian</a></li>
<li><a href="#sec-82">82. Thrash</a></li>
<li><a href="#sec-83">83. Threadbare</a></li>
<li><a href="#sec-84">84. Throes</a></li>
<li><a href="#sec-85">85. Throng</a></li>
<li><a href="#sec-86">86. Thrust</a></li>
<li><a href="#sec-87">87. Thump</a></li>
<li><a href="#sec-88">88. Tiff</a></li>
<li><a href="#sec-89">89. Tilt</a></li>
<li><a href="#sec-90">90. Tinder</a></li>
<li><a href="#sec-91">91. Tinge</a></li>
<li><a href="#sec-92">92. Tirade</a></li>
<li><a href="#sec-93">93. Toil</a></li>
<li><a href="#sec-94">94. Toll</a></li>
<li><a href="#sec-95">95. Tome</a></li>
<li><a href="#sec-96">96. Torment</a></li>
<li><a href="#sec-97">97. Torrid</a></li>
<li><a href="#sec-98">98. Toss</a></li>
<li><a href="#sec-99">99. Totter</a></li>
<li><a href="#sec-100">100. Tract</a></li>
<li><a href="#sec-101">101. Traduce</a></li>
<li><a href="#sec-102">102. Traipse</a></li>
<li><a href="#sec-103">103. Traitor</a></li>
<li><a href="#sec-104">104. Tramp</a></li>
<li><a href="#sec-105">105. Transfigure</a></li>
<li><a href="#sec-106">106. Transient</a></li>
<li><a href="#sec-107">107. Trapeze</a></li>
<li><a href="#sec-108">108. Travesty</a></li>
<li><a href="#sec-109">109. Tremulous</a></li>
<li><a href="#sec-110">110. Tribute</a></li>
<li><a href="#sec-111">111. Trifle</a></li>
<li><a href="#sec-112">112. Trinket</a></li>
<li><a href="#sec-113">113. Trivia</a></li>
<li><a href="#sec-114">114. Trounce</a></li>
<li><a href="#sec-115">115. Truant</a></li>
<li><a href="#sec-116">116. Trudge</a></li>
<li><a href="#sec-117">117. Trumpery</a></li>
<li><a href="#sec-118">118. Tumble</a></li>
<li><a href="#sec-119">119. Tumult</a></li>
<li><a href="#sec-120">120. Turgid</a></li>
<li><a href="#sec-121">121. Tusk</a></li>
<li><a href="#sec-122">122. Tweak</a></li>
<li><a href="#sec-123">123. Twinge</a></li>
<li><a href="#sec-124">124. Tyro</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tacit</a></li>
<li><a href="#sec-2">2. Tactile</a></li>
<li><a href="#sec-3">3. Tangential</a></li>
<li><a href="#sec-4">4. Tangle</a></li>
<li><a href="#sec-5">5. Tantalize</a></li>
<li><a href="#sec-6">6. Tantamount</a></li>
<li><a href="#sec-7">7. Taper</a></li>
<li><a href="#sec-8">8. Tardy</a></li>
<li><a href="#sec-9">9. Tarnish</a></li>
<li><a href="#sec-10">10. Taunt</a></li>
<li><a href="#sec-11">11. Taut</a></li>
<li><a href="#sec-12">12. Tawdry</a></li>
<li><a href="#sec-13">13. Taxing</a></li>
<li><a href="#sec-14">14. Tedium</a></li>
<li><a href="#sec-15">15. Teem</a></li>
<li><a href="#sec-16">16. Temperate</a></li>
<li><a href="#sec-17">17. Temporal</a></li>
<li><a href="#sec-18">18. Tenable</a></li>
<li><a href="#sec-19">19. Tenacious</a></li>
<li><a href="#sec-20">20. Tenacity</a></li>
<li><a href="#sec-21">21. Tendentious</a></li>
<li><a href="#sec-22">22. Tenet</a></li>
<li><a href="#sec-23">23. Tenuous</a></li>
<li><a href="#sec-24">24. Tepid</a></li>
<li><a href="#sec-25">25. Terse</a></li>
<li><a href="#sec-26">26. Thatch</a></li>
<li><a href="#sec-27">27. Theatrical</a></li>
<li><a href="#sec-28">28. Thematic</a></li>
<li><a href="#sec-29">29. Therapeutic</a></li>
<li><a href="#sec-30">30. Thwart</a></li>
<li><a href="#sec-31">31. Timorous</a></li>
<li><a href="#sec-32">32. Titular</a></li>
<li><a href="#sec-33">33. Toady</a></li>
<li><a href="#sec-34">34. Topple</a></li>
<li><a href="#sec-35">35. Torpid</a></li>
<li><a href="#sec-36">36. Torpor</a></li>
<li><a href="#sec-37">37. Tortuous</a></li>
<li><a href="#sec-38">38. Totalitarian</a></li>
<li><a href="#sec-39">39. Tout</a></li>
<li><a href="#sec-40">40. Tractable</a></li>
<li><a href="#sec-41">41. Trait</a></li>
<li><a href="#sec-42">42. Trample</a></li>
<li><a href="#sec-43">43. Tranquil</a></li>
<li><a href="#sec-44">44. Transcend</a></li>
<li><a href="#sec-45">45. Transcendent</a></li>
<li><a href="#sec-46">46. Transcribe</a></li>
<li><a href="#sec-47">47. Transcription</a></li>
<li><a href="#sec-48">48. Transgress</a></li>
<li><a href="#sec-49">49. Transitory</a></li>
<li><a href="#sec-50">50. Transmute</a></li>
<li><a href="#sec-51">51. Treacherous</a></li>
<li><a href="#sec-52">52. Tread</a></li>
<li><a href="#sec-53">53. Treatise</a></li>
<li><a href="#sec-54">54. Trenchant</a></li>
<li><a href="#sec-55">55. Trepidation</a></li>
<li><a href="#sec-56">56. Trespass</a></li>
<li><a href="#sec-57">57. Tribulation</a></li>
<li><a href="#sec-58">58. Tributary</a></li>
<li><a href="#sec-59">59. Trickle</a></li>
<li><a href="#sec-60">60. Trilogy</a></li>
<li><a href="#sec-61">61. Trite</a></li>
<li><a href="#sec-62">62. Truce</a></li>
<li><a href="#sec-63">63. Truculent</a></li>
<li><a href="#sec-64">64. Turbulent</a></li>
<li><a href="#sec-65">65. Turmoil</a></li>
<li><a href="#sec-66">66. Tyrant</a></li>
<li><a href="#sec-67">67. Taciturn</a></li>
<li><a href="#sec-68">68. Tally</a></li>
<li><a href="#sec-69">69. Tame</a></li>
<li><a href="#sec-70">70. Tantrum</a></li>
<li><a href="#sec-71">71. Tarry</a></li>
<li><a href="#sec-72">72. Tart</a></li>
<li><a href="#sec-73">73. Teeter</a></li>
<li><a href="#sec-74">74. Temerity</a></li>
<li><a href="#sec-75">75. Tempest</a></li>
<li><a href="#sec-76">76. Tempestuous</a></li>
<li><a href="#sec-77">77. Temporize</a></li>
<li><a href="#sec-78">78. Testy</a></li>
<li><a href="#sec-79">79. Thaw</a></li>
<li><a href="#sec-80">80. Thermal</a></li>
<li><a href="#sec-81">81. Thespian</a></li>
<li><a href="#sec-82">82. Thrash</a></li>
<li><a href="#sec-83">83. Threadbare</a></li>
<li><a href="#sec-84">84. Throes</a></li>
<li><a href="#sec-85">85. Throng</a></li>
<li><a href="#sec-86">86. Thrust</a></li>
<li><a href="#sec-87">87. Thump</a></li>
<li><a href="#sec-88">88. Tiff</a></li>
<li><a href="#sec-89">89. Tilt</a></li>
<li><a href="#sec-90">90. Tinder</a></li>
<li><a href="#sec-91">91. Tinge</a></li>
<li><a href="#sec-92">92. Tirade</a></li>
<li><a href="#sec-93">93. Toil</a></li>
<li><a href="#sec-94">94. Toll</a></li>
<li><a href="#sec-95">95. Tome</a></li>
<li><a href="#sec-96">96. Torment</a></li>
<li><a href="#sec-97">97. Torrid</a></li>
<li><a href="#sec-98">98. Toss</a></li>
<li><a href="#sec-99">99. Totter</a></li>
<li><a href="#sec-100">100. Tract</a></li>
<li><a href="#sec-101">101. Traduce</a></li>
<li><a href="#sec-102">102. Traipse</a></li>
<li><a href="#sec-103">103. Traitor</a></li>
<li><a href="#sec-104">104. Tramp</a></li>
<li><a href="#sec-105">105. Transfigure</a></li>
<li><a href="#sec-106">106. Transient</a></li>
<li><a href="#sec-107">107. Trapeze</a></li>
<li><a href="#sec-108">108. Travesty</a></li>
<li><a href="#sec-109">109. Tremulous</a></li>
<li><a href="#sec-110">110. Tribute</a></li>
<li><a href="#sec-111">111. Trifle</a></li>
<li><a href="#sec-112">112. Trinket</a></li>
<li><a href="#sec-113">113. Trivia</a></li>
<li><a href="#sec-114">114. Trounce</a></li>
<li><a href="#sec-115">115. Truant</a></li>
<li><a href="#sec-116">116. Trudge</a></li>
<li><a href="#sec-117">117. Trumpery</a></li>
<li><a href="#sec-118">118. Tumble</a></li>
<li><a href="#sec-119">119. Tumult</a></li>
<li><a href="#sec-120">120. Turgid</a></li>
<li><a href="#sec-121">121. Tusk</a></li>
<li><a href="#sec-122">122. Tweak</a></li>
<li><a href="#sec-123">123. Twinge</a></li>
<li><a href="#sec-124">124. Tyro</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-05-24 08:40:06</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/tacit-in-a-sentence/">Tacit</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>implied but not directly stated</code>
</p>

<ul class="org-ul">
<li>Although no words were spoken, our nods represented our tacit agreement to a cease fire.
</li>
<li>In my business, all that is needed for a tacit understanding is a handshake between men.
</li>
<li>Even though my boyfriend and I have only been dating for three months, we have a tacit understanding to not date other people.
</li>
<li>In order to take the school field trip, you will need more than your parent’s tacit consent.
</li>
<li>Although the world leaders have not signed the treaty yet, they have made a tacit pact on nuclear disarmament.
</li>
<li>The police always have the tacit understanding they can do whatever it takes to protect the lives of the public.
</li>
<li>During the minister’s speech, I found myself nodding in tacit support.
</li>
</ul>
</div>
</div>
