ruby/T.org
* [[https://wordsinasentence.com/tactile-in-a-sentence/][Tactile]]

  =in regards to the sense of touch=

  - The child’s tactile response was to move her hand away from the hot stove.
  - When I accidently touched the cactus, my tactile senses told my brain to quickly remove my fingers.
  - I receive a tactile pleasure each time I run my hand over the plush carpet.
  - In the aquarium, there is a tactile exhibit where students can touch exotic ocean creatures.
  - The man who was both blind and deaf relied on his tactile senses to move safely around his house.
  - After the surgery, the doctor attempted to get the patient to respond to tactile stimulation by hitting him gently with a *reflex hammer*.
  - The blind girl used her tactile sense to read the book that was written in Braille.


* [[https://wordsinasentence.com/tangential-in-a-sentence/][Tangential]]

  =not directly related to something=

  - I hardly ever learn anything in my history class because my teacher always rambles off on a tangential topic that has nothing to do with history.
  - During the student’s presentation, she was so nervous her speech was filled with tangential thoughts that were not related to each other.
  - Our team lost the debate because our responses were tangential and did not respond to our opponent’s position on the subject.
  - Although Alan owned a part of the basketball team, he had only a tangential interest in the sport and rarely watched the games.

* [[https://wordsinasentence.com/tangle-in-a-sentence/][Tangle]]

  =to become mixed together or intertwined=

  - Tara’s mother yelled as Tara was getting out of the shower, “If you don’t comb your wet hair, it may tangle.”
  - Environmentalists argue against the manufacturing of plastic due to the fact that *marine life* =海洋生物= often tangle with the plastic trash in the ocean.
  - No matter how much I tried to keep the *cords* neat behind the television set, they would always tangle with each other.
  - All the string in the basket would tangle and be difficult to *unravel*.

* [[https://wordsinasentence.com/tantalize-in-a-sentence/][Tantalize]]

  =to tease someone with a promise and then not deliver upon it=

  - In an attempt to tantalize me, my personal trainer offered a piece of cake as an incentive for me to finish my three miles on the treadmill.
  - A car salesman will often tantalize you with an expensive vehicle that is not within your budget.
  - Because my baby sister likes to tantalize the dog, she will sometimes offer him a bone and then take it back.
  - The purpose of a lottery commercial or radio advertisement is to tantalize people into believing they can become wealthy with the purchase of a lottery ticket.
  - When my rival got the bike I wanted, she rode by my house just to tantalize me.
  - The gym’s commercial strives to tantalize consumers with a low *introductory rate* =先期利率= that increases as soon as a person walks through the door.
  - Although the strange man tried to tantalize the girl with ice cream, he still could not get her inside of his van.

* [[https://wordsinasentence.com/tantamount-in-a-sentence/][Tantamount]]

  =equal to something=

  - *Mooching off* =揩油，啃老= your mother at age 35 is tantamount to being a lazy bum.
  - To leave a dog in a hot car is tantamount to torture.
  - Some parents say that spanking is tantamount to child abuse while others believe it's effective discipline.
  - Taking money from your mother's purse without asking her first is tantamount to stealing.
  - While some believe IQ tests are tantamount to measuring your true intelligence, others believe these tests cannot survey your intellect.
  - Many consider the old man's efforts of cooking for the homeless tantamount to charity.
  - Young man, your behavior in church should be tantamount to that of a behaved gentleman!


* [[https://wordsinasentence.com/taper-in-a-sentence/][Taper]]

  =to make thinner or narrower at one end or to diminish gradually=

  - The more I sketched my drawing, the more my pencil began to taper.
  - The woman asked the artist to gradually taper her tattoo down her back.
  - Because the uneven walls would taper, the room would be difficult to wallpaper.
  - Her hair color *tapered* =渐减= from brown to red.

* [[https://wordsinasentence.com/tardy-in-a-sentence/][Tardy]]

  =late to a specific event or delayed beyond the expected time=

  - Students who do not arrive to class on time are tardy, and they often receive some sort of penalty for it.
  - I missed my train because I was tardy in arriving to the metro, forcing me to wait for the next one.
  - I was tardy to my own wedding, but only because there was an accident on the road that stopped traffic.
  - Because the point of an interview is to make a good impression on a potential employer, you should never be tardy.

* [[https://wordsinasentence.com/tarnish-in-a-sentence/][Tarnish]]

  =a dullness of color or luster=

  - The once shiny candlesticks now only had a tarnish about them, not being as pretty as they once were.
  - Tarnish on silverware makes them less valuable than new silverware, because they are no longer shiny and reflective.
  - If you touch silver too much you will make it tarnish, causing it to lose its luster and be less valuable.
  - The once shiny doorknob has been touched so much that it now has only a dull and lifeless tarnish.

* [[https://wordsinasentence.com/taunt-in-a-sentence/][Taunt]]

  =using insults to try and trigger a response=

  - As the visiting team walked on the court, the hometown fans began to taunt the players.
  - Sometimes Billy fakes an illness so he does not have to deal with the bullies who taunt him at school.
  - When the girl chose to taunt her enemy on social media, she did not realize other people would attack her in retaliation.
  - The demonstrators yelled foul chants to taunt the police officers.

* [[https://wordsinasentence.com/taut-in-a-sentence/][Taut]]

  =stressed to the point of being nervous=

  - As I waited for the results of my lab tests, I was taut with anxiety.
  - Bill was taut with worry as he waited for the doctor to update him on his wife’s recovery status.
  - Since I wanted to have the perfect wedding, I was taut with nerves on the day of the event.
  - Jim’s preparation for his final exam left him taut and irritable.
  - Although Henry has flown many times, he still gets taut every time he boards a plane and has to calm himself with a scotch and soda.
  - It was apparent from the girl’s pale face that the idea of riding the roller coaster made her taut.
  - As Frank moved from one stage of the competition to the next, his brain became taut from the pressure.

