ruby/T.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/tactile-in-a-sentence/">Tactile</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>in regards to the sense of touch</code>
</p>

<ul class="org-ul">
<li>The child’s tactile response was to move her hand away from the hot stove.
</li>
<li>When I accidently touched the cactus, my tactile senses told my brain to quickly remove my fingers.
</li>
<li>I receive a tactile pleasure each time I run my hand over the plush carpet.
</li>
<li>In the aquarium, there is a tactile exhibit where students can touch exotic ocean creatures.
</li>
<li>The man who was both blind and deaf relied on his tactile senses to move safely around his house.
</li>
<li>After the surgery, the doctor attempted to get the patient to respond to tactile stimulation by hitting him gently with a <b>reflex hammer</b>.
</li>
<li>The blind girl used her tactile sense to read the book that was written in Braille.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/tangential-in-a-sentence/">Tangential</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>not directly related to something</code>
</p>

<ul class="org-ul">
<li>I hardly ever learn anything in my history class because my teacher always rambles off on a tangential topic that has nothing to do with history.
</li>
<li>During the student’s presentation, she was so nervous her speech was filled with tangential thoughts that were not related to each other.
</li>
<li>Our team lost the debate because our responses were tangential and did not respond to our opponent’s position on the subject.
</li>
<li>Although Alan owned a part of the basketball team, he had only a tangential interest in the sport and rarely watched the games.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/tangle-in-a-sentence/">Tangle</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>to become mixed together or intertwined</code>
</p>

<ul class="org-ul">
<li>Tara’s mother yelled as Tara was getting out of the shower, “If you don’t comb your wet hair, it may tangle.”
</li>
<li>Environmentalists argue against the manufacturing of plastic due to the fact that <b>marine life</b> <code>海洋生物</code> often tangle with the plastic trash in the ocean.
</li>
<li>No matter how much I tried to keep the <b>cords</b> neat behind the television set, they would always tangle with each other.
</li>
<li>All the string in the basket would tangle and be difficult to <b>unravel</b>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/tantalize-in-a-sentence/">Tantalize</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>to tease someone with a promise and then not deliver upon it</code>
</p>

<ul class="org-ul">
<li>In an attempt to tantalize me, my personal trainer offered a piece of cake as an incentive for me to finish my three miles on the treadmill.
</li>
<li>A car salesman will often tantalize you with an expensive vehicle that is not within your budget.
</li>
<li>Because my baby sister likes to tantalize the dog, she will sometimes offer him a bone and then take it back.
</li>
<li>The purpose of a lottery commercial or radio advertisement is to tantalize people into believing they can become wealthy with the purchase of a lottery ticket.
</li>
<li>When my rival got the bike I wanted, she rode by my house just to tantalize me.
</li>
<li>The gym’s commercial strives to tantalize consumers with a low <b>introductory rate</b> <code>先期利率</code> that increases as soon as a person walks through the door.
</li>
<li>Although the strange man tried to tantalize the girl with ice cream, he still could not get her inside of his van.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/tantamount-in-a-sentence/">Tantamount</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>equal to something</code>
</p>

<ul class="org-ul">
<li><b>Mooching off</b> <code>揩油，啃老</code> your mother at age 35 is tantamount to being a lazy bum.
</li>
<li>To leave a dog in a hot car is tantamount to torture.
</li>
<li>Some parents say that spanking is tantamount to child abuse while others believe it's effective discipline.
</li>
<li>Taking money from your mother's purse without asking her first is tantamount to stealing.
</li>
<li>While some believe IQ tests are tantamount to measuring your true intelligence, others believe these tests cannot survey your intellect.
</li>
<li>Many consider the old man's efforts of cooking for the homeless tantamount to charity.
</li>
<li>Young man, your behavior in church should be tantamount to that of a behaved gentleman!
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/taper-in-a-sentence/">Taper</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>to make thinner or narrower at one end or to diminish gradually</code>
</p>

<ul class="org-ul">
<li>The more I sketched my drawing, the more my pencil began to taper.
</li>
<li>The woman asked the artist to gradually taper her tattoo down her back.
</li>
<li>Because the uneven walls would taper, the room would be difficult to wallpaper.
</li>
<li>Her hair color <b>tapered</b> <code>渐减</code> from brown to red.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/tardy-in-a-sentence/">Tardy</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>late to a specific event or delayed beyond the expected time</code>
</p>

<ul class="org-ul">
<li>Students who do not arrive to class on time are tardy, and they often receive some sort of penalty for it.
</li>
<li>I missed my train because I was tardy in arriving to the metro, forcing me to wait for the next one.
</li>
<li>I was tardy to my own wedding, but only because there was an accident on the road that stopped traffic.
</li>
<li>Because the point of an interview is to make a good impression on a potential employer, you should never be tardy.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/tarnish-in-a-sentence/">Tarnish</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>a dullness of color or luster</code>
</p>

<ul class="org-ul">
<li>The once shiny candlesticks now only had a tarnish about them, not being as pretty as they once were.
</li>
<li>Tarnish on silverware makes them less valuable than new silverware, because they are no longer shiny and reflective.
</li>
<li>If you touch silver too much you will make it tarnish, causing it to lose its luster and be less valuable.
</li>
<li>The once shiny doorknob has been touched so much that it now has only a dull and lifeless tarnish.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/taunt-in-a-sentence/">Taunt</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>using insults to try and trigger a response</code>
</p>

<ul class="org-ul">
<li>As the visiting team walked on the court, the hometown fans began to taunt the players.
</li>
<li>Sometimes Billy fakes an illness so he does not have to deal with the bullies who taunt him at school.
</li>
<li>When the girl chose to taunt her enemy on social media, she did not realize other people would attack her in retaliation.
</li>
<li>The demonstrators yelled foul chants to taunt the police officers.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/taut-in-a-sentence/">Taut</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>stressed to the point of being nervous</code>
</p>

<ul class="org-ul">
<li>As I waited for the results of my lab tests, I was taut with anxiety.
</li>
<li>Bill was taut with worry as he waited for the doctor to update him on his wife’s recovery status.
</li>
<li>Since I wanted to have the perfect wedding, I was taut with nerves on the day of the event.
</li>
<li>Jim’s preparation for his final exam left him taut and irritable.
</li>
<li>Although Henry has flown many times, he still gets taut every time he boards a plane and has to calm himself with a scotch and soda.
</li>
<li>It was apparent from the girl’s pale face that the idea of riding the roller coaster made her taut.
</li>
<li>As Frank moved from one stage of the competition to the next, his brain became taut from the pressure.
</li>
</ul>
</div>
</div>
