ruby/T.org
* [[https://wordsinasentence.com/tawdry-in-a-sentence/][Tawdry]]

  =cheap and poor in appearance or quality=

  - Everyone is always expecting a politician to have a tawdry affair.
  - Although Aunt Eloise had lots of money, she always wore such tawdry jewerly.
  - Most people consider reality shows to be tawdry forms of entertainment.
  - Have you ever read any of those tawdry stories in that gossip magazine?
  - Despite the fact Angelina plays a tawdry woman on television, she is actually very sophisticated in real life.
  - The white dress was thin and tawdry.
  - Ginger’s tawdry taste in clothes totally embarrassed her teenage daughter!

* [[https://wordsinasentence.com/taxing-in-a-sentence/][Taxing]]

  =physically or mentally challenging/demanding=

  - Working all day and raising a family can be a taxing task on any single parent.
  - After a rough few months at work, we needed a vacation to overcome our mentally and physically taxing careers.
  - Although he has a physically taxing job, the mechanic enjoys the challenge of his profession.
  - Because she works all day with no break, the teacher’s taxing job often leaves her exhausted.

* [[https://wordsinasentence.com/tedium-in-a-sentence/][Tedium]]

  =the condition of being dull or boring for a long period=

  - To ease the tedium of looking at accounting forms all day, I listen to bubbly music while I work.
  - We went to the *golf range* after a day of tedium at the office.
  - Because the tedium of the book’s plot made me drowsy, I fell asleep while reading.
  - The yawning student walked out of class when he could no longer bear the tedium of the professor’s lecture.

* [[https://wordsinasentence.com/teem-in-a-sentence/][Teem]]

  =to be present or gather in a large number=

  - Honeycombs teem with worker bees who work tirelessly to produce honey for their queen.
  - After major award shows like the Grammys, paparazzi and reporters teem the red carpet.
  - Emergency personnel teem at the scene of the accident.
  - Suddenly the river began to teem with salmon and the hungry bears eagerly took to the water for food.

* [[https://wordsinasentence.com/temperate-in-a-sentence/][Temperate]]

  =to have moderate or mild weather=

  - Living in a temperate climate, I sometimes had to wear my jacket in the early fall since it was cool outside.
  - While walking through the temperate forest, the rain began to fall heavily through the leaves in the warm summer temperature.
  - Since I live in a temperate region, I experience all of the seasons from warm summers to cold winters.
  - As Jeff and Jen toured the country in the temperate climatic zone, they knew crops could grow here due to the heat of the sun not being too hot.

* [[https://wordsinasentence.com/temporal-in-a-sentence/][Temporal]]

  =associated with the real world and not the spiritual world=

  - Liam's very religious aunt believes people should shun temporal pleasures and focus on being worthy of the joys of the afterlife.
  - According to my minister, those who follow the path of Christ will not be bothered with temporal chores like eating in the spiritual world.
  - The monk’s commitment requires him to ignore the temporal pleasures of the world.
  - Since the atheist does not believe in a heavenly world, he focuses on enjoying the temporal amusements of life.
  - Mark has no fear of dying and leaving the temporal world behind because he knows he will live forever in God’s kingdom.
  - While pastors focus on the spiritual wellbeing of individuals, cruise directors ensure guests enjoy the temporal delights of the voyage.
  - Rachel was impatient for the church service to end so she could return to her temporal life with her online friends.


* [[https://wordsinasentence.com/tenable-in-a-sentence/][Tenable]]

  =able to be protected or maintained=

  - During the battle, we were fortunate to be safe behind a tenable castle wall.
  - Jim lost the debate because his argument was not tenable and quickly fell apart.
  - As the game neared its end, the coach told his players to hold a tenable position so their rivals could not score a touchdown.
  - The defense attorney knew his client would need a tenable alibi to stay out of jail.
  - After three years of research, the scientist was able to present a tenable theory to an important scientific journal.
  - Adam knew his claim of innocence was no longer tenable when the DNA results linked him to the crime.
  - If you do not eat well before the race, it will be difficult to keep your energy level tenable.

* [[https://wordsinasentence.com/tenacious-in-a-sentence/][Tenacious]]

  =not readily letting go of or giving up=

  - Even though Jackson was smaller than his other teammates, his tenacious attitude allowed him to accomplish as much as they did.
  - Because Eva was tenacious, she rose each time she fell.
  - Trapped in the cabin, the tenacious teenager would not quit until she found a way to escape.
  - Although the odds were against them, the tenacious group of soldiers held on until reinforcements arrived.
  - Although my grandmother’s doctor told her she needed to quit smoking, she remained tenacious and would not give up her favorite habit.
  - The tenacious match between the two wrestling champs did not end until one of them passed out in the ring.
  - Determined to capture the killer, the police officer was tenacious in his pursuit.

* [[https://wordsinasentence.com/tenacity-in-a-sentence/][Tenacity]]

  =the quality of being determined to do or achieve something=

  - Jake’s tenacity allowed him to excel in college while working two jobs.
  - While Aaron is not the largest football player on the team, he has a tenacity that makes him just as productive as his biggest teammate.
  - Unpacking all these boxes is going to require a great deal of tenacity.
  - By sheer tenacity alone, I have made it through medical school while being a single mother.
  - Alone on the deserted island, the man knew he would need tenacity to survive until the rescuers arrived.
  - The male hikers were pleasantly surprised by Katie’s tenacity on the tiring journey.
  - If it were not for the tenacity of the civil rights leaders, many people would still not be able to vote in this country.

