ruby/T.org
* [[https://wordsinasentence.com/tendentious-in-a-sentence/][Tendentious]]

  =exhibiting a certain prejudice towards a subject=

  - The president was tendentious on his plan for the company and would not listen to other options.
  - Because my father is tendentious on the subject of interracial relationships, he will not acknowledge my black boyfriend.
  - I left my church because of the minister’s tendentious attitude about the importance of rejecting nonmembers.
  - As I read the tendentious book review, it was obvious the reviewer had a personal issue with the author.

* [[https://wordsinasentence.com/tenet-in-a-sentence/][Tenet]]

  =a belief or opinion considered valid by a group or individual=

  - According to the church’s tenet, ministers are forbidden to marry so they can give their entire souls to God.
  - Many people believe the tenet that parents should be responsible for the behaviors of their children.
  - While I do not discourage you from drinking alcohol, my religious tenet limits my drinking to non-alcoholic substances.
  - As a doctor, Kent strongly believes the tenet of never doing any harm.
  - The primary tenet of our political system is the belief all people have the right to vote.
  - Despite popular beliefs, polygamy is not a tenet of the Mormon religion.
  - The members of the cult unconditionally accepted their prophet’s tenet about the existence of life after death.

* [[https://wordsinasentence.com/tenuous-in-a-sentence/][Tenuous]]

  =weak and likely to change; having little substance or strength=

  - Because the evidence against her is tenuous, the accused murderer will be released from jail on bail.
  - Since we are separated in age by eight years and have few common interests, my sister and I only share a tenuous bond of friendship.
  - The uneducated man made a tenuous argument against the importance of obtaining a higher education.
  - Although the frozen lake was quite tenuous and unstable, Henry still decided to cross it on foot.
  - As long as you can only provide tenuous proof the billionaire was your father, you will never receive a portion of his estate!
  - The judge called the defense’s argument tenuous and ruled in favor of the *plaintiff* =原告=.
  - Since I am not feeling very well today, the odds of me attending the party are tenuous.

* [[https://wordsinasentence.com/tepid-in-a-sentence/][Tepid]]

  =displaying little interest or enthusiasm=

  - The play’s premiere received tepid reviews from the disappointed critics.
  - From Jared’s tepid response, it was obvious he did not like his Christmas gift.
  - The president has seen his popularity grow tepid ever since he mishandled the budget crisis.
  - After ten years of marriage, the couple’s sex life has become tepid and unexciting.
  - My sister recently lost her government job because the state’s tepid economy has resulted in numerous cutbacks.
  - Because of poor sales this year, the company has a tepid forecast for its profit margin.
  - Sheila knew her husband’s passion had become tepid when he stopped kissing her each morning.


* [[https://wordsinasentence.com/terse-in-a-sentence/][Terse]]

  =a very short statement or remark=

  - When Jessie is angry, she only gives terse responses.
  - Because they had little information on the suspect, the police issued only a terse statement to the media.
  - Her email was so terse I could only wonder if she was upset about something.
  - Although Phillip is known for making long speeches, this speech was incredibly terse.
  - When I asked if I could borrow his car, my father sent me away with a terse refusal.
  - To make a long story terse, we never made it to the game that night because of the flat tire.
  - My husband’s terse one-word reply let me know he was not pleased with me coming home late.

* [[https://wordsinasentence.com/thatch-in-a-sentence/][Thatch]]

  =the top part on a house made of hay, stalks, grasses or foliage=

  - Wind blew away part of the thatch on the cottage causing droplets of water to pour down into the rooms.
  - Tribal villages frequently will have a roof of thatch and stick walls so that a breeze can blow through the house on the hot days.
  - If the thatch remains intact while in the midst of the hurricane, then just about any material could be used for the roof in this tropical area.
  - In order to use a thatch on the roof, the roofers gathered many pieces of straw and *plots of sod* to weave over the frame of the house.

* [[https://wordsinasentence.com/theatrical-in-a-sentence/][Theatrical]]

  =pertaining to drama or the performing arts=

  - Bryson Middle School’s theatrical production of Annie was being shown at the school’s auditorium for three nights.
  - Needing someone who was skilled in theatrical make-up, the director interviewed a few candidates who had worked behind the stage of Broadway.
  - For Halloween I went to a costume shop for a superhero costume, but all they seemed to have were theatrical costumes for *period pieces* =年代剧=.
  - Due to Sarah’s dramatic ways of expression, her simple speech about social media turned into a theatrical presentation.

* [[https://wordsinasentence.com/thematic-in-a-sentence/][Thematic]]

  =pertaining to a certain topic, idea or matter=

  - Ms. Taylor taught all of her subjects in her 4th grade class using a thematic unit about careers.
  - On the thematic map depicting the agriculture grown in the U.S., the students were able to determine that rice is grown in Mississippi and grapes on the West Coast.
  - While the scientist gathered his qualitative data, he was able to determine the pattern of rain due to his thematic analysis of the examined data.
  - After years of study, Dr. Hodges gave his thematic perspective to the development of the elephant’s lifespan before moving on to another animal.

* [[https://wordsinasentence.com/therapeutic-in-a-sentence/][Therapeutic]]

  =associated with the healing of a sickness=

  - The therapeutic massage relieved the pain in my back.
  - If this medicine does not afford me any therapeutic benefits, I see no point in taking it.
  - I use yoga as a therapeutic tool to help me relieve stress.
  - Since the antibiotic did not provide me with any therapeutic relief, my doctor gave me a new prescription.



