ruby/T.html

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/tendentious-in-a-sentence/">Tendentious</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>exhibiting a certain prejudice towards a subject</code>
</p>

<ul class="org-ul">
<li>The president was tendentious on his plan for the company and would not listen to other options.
</li>
<li>Because my father is tendentious on the subject of interracial relationships, he will not acknowledge my black boyfriend.
</li>
<li>I left my church because of the minister’s tendentious attitude about the importance of rejecting nonmembers.
</li>
<li>As I read the tendentious book review, it was obvious the reviewer had a personal issue with the author.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/tenet-in-a-sentence/">Tenet</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>a belief or opinion considered valid by a group or individual</code>
</p>

<ul class="org-ul">
<li>According to the church’s tenet, ministers are forbidden to marry so they can give their entire souls to God.
</li>
<li>Many people believe the tenet that parents should be responsible for the behaviors of their children.
</li>
<li>While I do not discourage you from drinking alcohol, my religious tenet limits my drinking to non-alcoholic substances.
</li>
<li>As a doctor, Kent strongly believes the tenet of never doing any harm.
</li>
<li>The primary tenet of our political system is the belief all people have the right to vote.
</li>
<li>Despite popular beliefs, polygamy is not a tenet of the Mormon religion.
</li>
<li>The members of the cult unconditionally accepted their prophet’s tenet about the existence of life after death.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/tenuous-in-a-sentence/">Tenuous</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>weak and likely to change; having little substance or strength</code>
</p>

<ul class="org-ul">
<li>Because the evidence against her is tenuous, the accused murderer will be released from jail on bail.
</li>
<li>Since we are separated in age by eight years and have few common interests, my sister and I only share a tenuous bond of friendship.
</li>
<li>The uneducated man made a tenuous argument against the importance of obtaining a higher education.
</li>
<li>Although the frozen lake was quite tenuous and unstable, Henry still decided to cross it on foot.
</li>
<li>As long as you can only provide tenuous proof the billionaire was your father, you will never receive a portion of his estate!
</li>
<li>The judge called the defense’s argument tenuous and ruled in favor of the <b>plaintiff</b> <code>原告</code>.
</li>
<li>Since I am not feeling very well today, the odds of me attending the party are tenuous.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/tepid-in-a-sentence/">Tepid</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>displaying little interest or enthusiasm</code>
</p>

<ul class="org-ul">
<li>The play’s premiere received tepid reviews from the disappointed critics.
</li>
<li>From Jared’s tepid response, it was obvious he did not like his Christmas gift.
</li>
<li>The president has seen his popularity grow tepid ever since he mishandled the budget crisis.
</li>
<li>After ten years of marriage, the couple’s sex life has become tepid and unexciting.
</li>
<li>My sister recently lost her government job because the state’s tepid economy has resulted in numerous cutbacks.
</li>
<li>Because of poor sales this year, the company has a tepid forecast for its profit margin.
</li>
<li>Sheila knew her husband’s passion had become tepid when he stopped kissing her each morning.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/terse-in-a-sentence/">Terse</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>a very short statement or remark</code>
</p>

<ul class="org-ul">
<li>When Jessie is angry, she only gives terse responses.
</li>
<li>Because they had little information on the suspect, the police issued only a terse statement to the media.
</li>
<li>Her email was so terse I could only wonder if she was upset about something.
</li>
<li>Although Phillip is known for making long speeches, this speech was incredibly terse.
</li>
<li>When I asked if I could borrow his car, my father sent me away with a terse refusal.
</li>
<li>To make a long story terse, we never made it to the game that night because of the flat tire.
</li>
<li>My husband’s terse one-word reply let me know he was not pleased with me coming home late.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/thatch-in-a-sentence/">Thatch</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>the top part on a house made of hay, stalks, grasses or foliage</code>
</p>

<ul class="org-ul">
<li>Wind blew away part of the thatch on the cottage causing droplets of water to pour down into the rooms.
</li>
<li>Tribal villages frequently will have a roof of thatch and stick walls so that a breeze can blow through the house on the hot days.
</li>
<li>If the thatch remains intact while in the midst of the hurricane, then just about any material could be used for the roof in this tropical area.
</li>
<li>In order to use a thatch on the roof, the roofers gathered many pieces of straw and <b>plots of sod</b> to weave over the frame of the house.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/theatrical-in-a-sentence/">Theatrical</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>pertaining to drama or the performing arts</code>
</p>

<ul class="org-ul">
<li>Bryson Middle School’s theatrical production of Annie was being shown at the school’s auditorium for three nights.
</li>
<li>Needing someone who was skilled in theatrical make-up, the director interviewed a few candidates who had worked behind the stage of Broadway.
</li>
<li>For Halloween I went to a costume shop for a superhero costume, but all they seemed to have were theatrical costumes for <b>period pieces</b> <code>年代剧</code>.
</li>
<li>Due to Sarah’s dramatic ways of expression, her simple speech about social media turned into a theatrical presentation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/thematic-in-a-sentence/">Thematic</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>pertaining to a certain topic, idea or matter</code>
</p>

<ul class="org-ul">
<li>Ms. Taylor taught all of her subjects in her 4th grade class using a thematic unit about careers.
</li>
<li>On the thematic map depicting the agriculture grown in the U.S., the students were able to determine that rice is grown in Mississippi and grapes on the West Coast.
</li>
<li>While the scientist gathered his qualitative data, he was able to determine the pattern of rain due to his thematic analysis of the examined data.
</li>
<li>After years of study, Dr. Hodges gave his thematic perspective to the development of the elephant’s lifespan before moving on to another animal.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/therapeutic-in-a-sentence/">Therapeutic</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>associated with the healing of a sickness</code>
</p>

<ul class="org-ul">
<li>The therapeutic massage relieved the pain in my back.
</li>
<li>If this medicine does not afford me any therapeutic benefits, I see no point in taking it.
</li>
<li>I use yoga as a therapeutic tool to help me relieve stress.
</li>
<li>Since the antibiotic did not provide me with any therapeutic relief, my doctor gave me a new prescription.
</li>
</ul>
</div>
</div>
