ruby/T.org
* [[https://wordsinasentence.com/thwart-in-a-sentence/][Thwart]]

  =to hinder or stop something from happening=

  - Someone built this wall with broken bottles set in the top to thwart the intrusion of outsiders.
  - After all the stress and planning, Zoey couldn’t believe that a case of chicken pox had come along to thwart her beautiful wedding.
  - In order to thwart the advancing enemy troops, the captain ordered the explosives team to destroy the bridge.
  - After a series of tragic school shootings, the President didn’t attempt to conceal his anger as he lashed out at the groups who were trying to thwart gun control legislation.
  - John realized that news of the scandal was going to thwart any chances of his winning the election.
  - The irony is that the roof keeps leaking because all these rains continue to thwart any chance of repair.
  - Even though the climbers could see the fog rolling in, they were determined that it would not thwart their progress in reaching the peak of the mountain.

* [[https://wordsinasentence.com/timorous-in-a-sentence/][Timorous]]

  =frightened=

  - The timorous kitten would not come out from under the bed.
  - Since I am allergic to most insect bites, I tend to be quite timorous even when I see a tiny spider.
  - The timorous witness refuses to testify because of the defendant’s murderous reputation.
  - During the storm, the timorous little boy would not come out of his closet.
  - The timorous man would not stand up to his abusive spouse.
  - To everyone’s surprise, the tough wrestler became timorous whenever he saw a snake.
  - Matt is an unusually timorous man who is easily scared by a fake spider.


* [[https://wordsinasentence.com/titular-in-a-sentence/][Titular]]

  =having a completely arbitrary position that is of no real power or authority=

  - England has a Queen, but today her position is completely titular and she has no authority in the government whatsoever.
  - Jim declared himself leader of our group, but his position is entirely titular because the rest of us did not elect him to that position.
  - We gave the man a titular position so he would feel important even though he is not, and he carries no real weight in the company.
  - We gave him the titular position of ‘Assistant President Assistant Director,’ which does not even really exist within the organization.

* [[https://wordsinasentence.com/toady-in-a-sentence/][Toady]]

  =an individual who compliments others for a reason=

  - In order to get a promotion, Amy has been acting like the manager’s toady by agreeing with everything he says.
  - Being the toady she is, Elaine *fawns over* the company president every time she sees him.
  - April became a toady when she brought the teacher an apple.
  - At our bank, Henry is the toady who constantly flatters the branch manager.

* [[https://wordsinasentence.com/topple-in-a-sentence/][Topple]]

  =to tumble over=

  - Placing the bowling ball onto the flimsy table caused it to topple over onto the floor.
  - After several *whacks* with the axe, the lumberjack started to make the tree topple over with a loud *thud*.
  - At first, the blocks in the Jenga game only began to lean until a small wind made the block tower topple down.
  - When the children stacked their crackers one on top of the other, it eventually would topple over for them to rebuild it.

* [[https://wordsinasentence.com/torpid-in-a-sentence/][Torpid]]

  =lazy or inactive=

  - My torpid brother rests on the couch all day.
  - When June is torpid, she will snuggle under her bed covers and watch television until she falls asleep.
  - The torpid student did nothing but sleep in class each day.
  - According to the preference settings, the laptop will go to sleep when it is has been torpid for five minutes.
  - The bear will be in a torpid state throughout the freezing winter.
  - Even though Jason could have earned perfect grades in school, he was torpid and rarely completed his assignments.
  - The torpid dog will not fetch the ball.

* [[https://wordsinasentence.com/torpor-in-a-sentence/][Torpor]]

  =the state of being motionless or inactive=

  - After overeating on Christmas, I fell into a satisfied torpor.
  - Hopefully the stock market will rise from its torpor and reach a year-end high.
  - If my husband does not come out of his torpor and get a job, I will divorce him.
  - Many voters are in political torpor and rarely go to the polls.
  - After a five-year torpor, the singer released a new album.
  - The stimulus checks helped to bring the economy out of torpor.
  - Before the gunshot victim came out of a coma, he was in torpor for two weeks.

* [[https://wordsinasentence.com/tortuous-in-a-sentence/][Tortuous]]

  =containing *coils*, turns and curves=

  - When the tortuous snake moved across the Sahara Desert, his body made an S-shape in the sand.
  - With the sign showing a tortuous road up ahead, we realized that we were traveling down the *bends* =弯道= of the mountain.
  - The tortuous large intestines could stretch out to be five feet long if they were unraveled from the human body.
  - After being in the rain for several hours, Carolyn’s tortuous hair looked like a big frizz ball.

* [[https://wordsinasentence.com/totalitarian-in-a-sentence/][Totalitarian]]

  =associated with a system of governance in which the government controls everything=

  - Some people feel the government is trying to take our civilian rights and turn our nation into a totalitarian state.
  - When the author depicts a totalitarian government, he describes a ruler who makes all the decisions for people in his kingdom.
  - Under the dictator’s totalitarian rule, the citizens of the country had no *say* =发言权= in how their nation was governed.
  - Religions and cultures that take away the rights of women are totalitarian in nature.


* [[https://wordsinasentence.com/tout-in-a-sentence/][Tout]]

  =to brag or flaunt=

  - Listening to the basketball player tout his skill becomes boring after a while.
  - Although Jared’s parents are extremely wealthy, he acts like a normal person and does not tout his background.
  - Sarah wears tight blouses to tout her full bosom.
  - As James tried to sell me a car, he went out of his way to tout the features of the most expensive vehicle on the lot.

