ruby/T.html



<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/thwart-in-a-sentence/">Thwart</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>to hinder or stop something from happening</code>
</p>

<ul class="org-ul">
<li>Someone built this wall with broken bottles set in the top to thwart the intrusion of outsiders.
</li>
<li>After all the stress and planning, Zoey couldn’t believe that a case of chicken pox had come along to thwart her beautiful wedding.
</li>
<li>In order to thwart the advancing enemy troops, the captain ordered the explosives team to destroy the bridge.
</li>
<li>After a series of tragic school shootings, the President didn’t attempt to conceal his anger as he lashed out at the groups who were trying to thwart gun control legislation.
</li>
<li>John realized that news of the scandal was going to thwart any chances of his winning the election.
</li>
<li>The irony is that the roof keeps leaking because all these rains continue to thwart any chance of repair.
</li>
<li>Even though the climbers could see the fog rolling in, they were determined that it would not thwart their progress in reaching the peak of the mountain.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/timorous-in-a-sentence/">Timorous</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>frightened</code>
</p>

<ul class="org-ul">
<li>The timorous kitten would not come out from under the bed.
</li>
<li>Since I am allergic to most insect bites, I tend to be quite timorous even when I see a tiny spider.
</li>
<li>The timorous witness refuses to testify because of the defendant’s murderous reputation.
</li>
<li>During the storm, the timorous little boy would not come out of his closet.
</li>
<li>The timorous man would not stand up to his abusive spouse.
</li>
<li>To everyone’s surprise, the tough wrestler became timorous whenever he saw a snake.
</li>
<li>Matt is an unusually timorous man who is easily scared by a fake spider.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/titular-in-a-sentence/">Titular</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>having a completely arbitrary position that is of no real power or authority</code>
</p>

<ul class="org-ul">
<li>England has a Queen, but today her position is completely titular and she has no authority in the government whatsoever.
</li>
<li>Jim declared himself leader of our group, but his position is entirely titular because the rest of us did not elect him to that position.
</li>
<li>We gave the man a titular position so he would feel important even though he is not, and he carries no real weight in the company.
</li>
<li>We gave him the titular position of ‘Assistant President Assistant Director,’ which does not even really exist within the organization.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/toady-in-a-sentence/">Toady</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>an individual who compliments others for a reason</code>
</p>

<ul class="org-ul">
<li>In order to get a promotion, Amy has been acting like the manager’s toady by agreeing with everything he says.
</li>
<li>Being the toady she is, Elaine <b>fawns over</b> the company president every time she sees him.
</li>
<li>April became a toady when she brought the teacher an apple.
</li>
<li>At our bank, Henry is the toady who constantly flatters the branch manager.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/topple-in-a-sentence/">Topple</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>to tumble over</code>
</p>

<ul class="org-ul">
<li>Placing the bowling ball onto the flimsy table caused it to topple over onto the floor.
</li>
<li>After several <b>whacks</b> with the axe, the lumberjack started to make the tree topple over with a loud <b>thud</b>.
</li>
<li>At first, the blocks in the Jenga game only began to lean until a small wind made the block tower topple down.
</li>
<li>When the children stacked their crackers one on top of the other, it eventually would topple over for them to rebuild it.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/torpid-in-a-sentence/">Torpid</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>lazy or inactive</code>
</p>

<ul class="org-ul">
<li>My torpid brother rests on the couch all day.
</li>
<li>When June is torpid, she will snuggle under her bed covers and watch television until she falls asleep.
</li>
<li>The torpid student did nothing but sleep in class each day.
</li>
<li>According to the preference settings, the laptop will go to sleep when it is has been torpid for five minutes.
</li>
<li>The bear will be in a torpid state throughout the freezing winter.
</li>
<li>Even though Jason could have earned perfect grades in school, he was torpid and rarely completed his assignments.
</li>
<li>The torpid dog will not fetch the ball.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/torpor-in-a-sentence/">Torpor</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>the state of being motionless or inactive</code>
</p>

<ul class="org-ul">
<li>After overeating on Christmas, I fell into a satisfied torpor.
</li>
<li>Hopefully the stock market will rise from its torpor and reach a year-end high.
</li>
<li>If my husband does not come out of his torpor and get a job, I will divorce him.
</li>
<li>Many voters are in political torpor and rarely go to the polls.
</li>
<li>After a five-year torpor, the singer released a new album.
</li>
<li>The stimulus checks helped to bring the economy out of torpor.
</li>
<li>Before the gunshot victim came out of a coma, he was in torpor for two weeks.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/tortuous-in-a-sentence/">Tortuous</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>containing *coils*, turns and curves</code>
</p>

<ul class="org-ul">
<li>When the tortuous snake moved across the Sahara Desert, his body made an S-shape in the sand.
</li>
<li>With the sign showing a tortuous road up ahead, we realized that we were traveling down the <b>bends</b> <code>弯道</code> of the mountain.
</li>
<li>The tortuous large intestines could stretch out to be five feet long if they were unraveled from the human body.
</li>
<li>After being in the rain for several hours, Carolyn’s tortuous hair looked like a big frizz ball.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/totalitarian-in-a-sentence/">Totalitarian</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>associated with a system of governance in which the government controls everything</code>
</p>

<ul class="org-ul">
<li>Some people feel the government is trying to take our civilian rights and turn our nation into a totalitarian state.
</li>
<li>When the author depicts a totalitarian government, he describes a ruler who makes all the decisions for people in his kingdom.
</li>
<li>Under the dictator’s totalitarian rule, the citizens of the country had no <b>say</b> <code>发言权</code> in how their nation was governed.
</li>
<li>Religions and cultures that take away the rights of women are totalitarian in nature.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/tout-in-a-sentence/">Tout</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>to brag or flaunt</code>
</p>

<ul class="org-ul">
<li>Listening to the basketball player tout his skill becomes boring after a while.
</li>
<li>Although Jared’s parents are extremely wealthy, he acts like a normal person and does not tout his background.
</li>
<li>Sarah wears tight blouses to tout her full bosom.
</li>
<li>As James tried to sell me a car, he went out of his way to tout the features of the most expensive vehicle on the lot.
</li>
</ul>
</div>
</div>
