ruby/T.org
* [[https://wordsinasentence.com/tractable-in-a-sentence/][Tractable]]

  =controlled or directed with ease=

  - The dog was more tractable when he wore the vibrating collar.
  - If the project becomes too large, it will no longer be tractable by a single manager.
  - The lab technicians will have no problem conducting the tractable experiments.
  - When the design is finished, a visually impaired person will be able to use the tractable remote control.
  - The tractable show horse instantly obeyed his handler’s commands.
  - Unlike his rebellious brother, Jack has a very tractable personality.
  - The warden put prisoners who refused to be tractable in isolation.

* [[https://wordsinasentence.com/trait-in-a-sentence/][Trait]]

  =a critical characteristic of a person’s personality=

  - Honesty is a trait that most parents greatly value in their children, as nothing is more troublesome than someone who lies to their parents.
  - If you ever take a personality test or go to an interview, you may be asked what your most valuable trait is, and the best answer is usually something like willpower or honesty.
  - Many intellectuals find their intelligence to be their most valuable trait, as they are more proud of that part of their character than anything else.
  - If there is one trait that no one appreciates in a friend, it is deceitfulness, because a friend you cannot trust is no friend at all.

* [[https://wordsinasentence.com/trample-in-a-sentence/][Trample]]

  =to crush, disfigure, maim, etc., by walking or running over something=

  - The girl walked lightly through the garden, carefully watching her feet so that she didn’t trample the beautiful flowers.
  - The concert was quickly filled with drunken party-goers and Layla knew that if she didn't leave now they were likely to trample her.
  - Chaos erupted as the bombs went off and *in their desperation* =拼死= to escape, they couldn't help but to trample those who were too slow.
  - After her boyfriend cheated on her, she wanted to trample him so she took all of his gifts and crushed them instead.

* [[https://wordsinasentence.com/tranquil-in-a-sentence/][Tranquil]]

  =relaxed; peaceful=

  - Since we were the only ones on the beach, we enjoyed a tranquil day.
  - The doctor says I need to be in a tranquil place so I can relax.
  - Surrounded by a beautiful waterfall and exotic flowers, how could Hiram feel anything but tranquil on his vacation?
  - The yoga instructor will show us the best way to reach a tranquil state.
  - When my little baby is sleeping peacefully, he wears a tranquil expression on his face.
  - While some people hate being around their families, I am never more tranquil than when I am surrounded by those I love.
  - In the emergency room, the doctor gave the agitated man a sedative to help him become tranquil.

* [[https://wordsinasentence.com/transcend-in-a-sentence/][Transcend]]

  =to exceed the limits of something=

  - The athlete hoped the increased training would allow him to transcend Olympic records.
  - According to some religions, you will transcend the limits of this world and enter another world when you die.
  - A good education will allow you to transcend many socioeconomic barriers.
  - To transcend her need to sleep, the college student took caffeine pills during final exam week.

* [[https://wordsinasentence.com/transcendent-in-a-sentence/][Transcendent]]

  =surpassing the ordinary; exceptional=

  - In order to completely identify with the plot of the science fiction movie, you must be able to consider the idea of transcendent experiences that allow people to enter the minds of others.
  - Experts are looking into the sequence of genetic alterations that allowed the transcendent mutation scientists recently discovered.
  - To many, a god is a transcendent being who has powers that exceed those of mere mortals.
  - The love-struck boy grew faint and felt as though he was having a transcendent occurrence every time he encountered the girl of his dreams.
  - When the little boy played a transcendent tune on the flute, the snake started to weave from side to side and eventually returned to its basket.
  - Beth describes her meeting with her favorite singer as a transcendent moment that changed her life.
  - Out of all of the people who have attended the sacred temple, half of them claim to have had transcendent experiences with heavenly creatures.

* [[https://wordsinasentence.com/transcribe-in-a-sentence/][Transcribe]]

  =to change a form of communication into another form=

  - The medical transcriptionist will transcribe the doctor’s notes by typing them into the computer.
  - When I finish my current project, I will transcribe all of the actor’s audiotapes and compile them into a written biography.
  - The translator will transcribe the deaf girl’s gestures so everyone in court can understand what she is saying.
  - Because I have sticky liquid on my hands, I will let my smartphone transcribe my vocal response into a text message.

* [[https://wordsinasentence.com/transcription-in-a-sentence/][Transcription]]

  =a written or printed representation of something=

  - You can listen to the audio version of the podcast or wait to read the transcription.
  - A transcription of the client’s medical records was placed inside the file once copied.
  - The attorney requested a transcription of all of the witness’s names and addresses.
  - Burning the transcription, the crooked banker made sure to get rid of any record of his theft.

* [[https://wordsinasentence.com/transgress-in-a-sentence/][Transgress]]

  =to act in violation of some law=

  - People who transgress the boundaries of social etiquette will be politely turned away at the door.
  - If all children were taught not to transgress the rules of common decency and good manners, the world would probably be a much better place for everyone.
  - Because I am a *law abiding citizen*, I take great pains not to transgress the speed limit or other traffic regulations.
  - After Luis agreed to the plan to transgress the dress code, he and his fellow rebels were suspended from school for three days.
  - Despite a strong urge to transgress the boundaries set by his parents, Alan decided to avoid more trouble and stay in his room.
  - He should have known better than to transgress the guidelines set down by the governing body.
  - Although Belinda didn’t want to transgress the unwritten social code of her class, she did the right thing by reporting what was happening in the girls’ restroom.


