ruby/T.html

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/tractable-in-a-sentence/">Tractable</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>controlled or directed with ease</code>
</p>

<ul class="org-ul">
<li>The dog was more tractable when he wore the vibrating collar.
</li>
<li>If the project becomes too large, it will no longer be tractable by a single manager.
</li>
<li>The lab technicians will have no problem conducting the tractable experiments.
</li>
<li>When the design is finished, a visually impaired person will be able to use the tractable remote control.
</li>
<li>The tractable show horse instantly obeyed his handler’s commands.
</li>
<li>Unlike his rebellious brother, Jack has a very tractable personality.
</li>
<li>The warden put prisoners who refused to be tractable in isolation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/trait-in-a-sentence/">Trait</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>a critical characteristic of a person’s personality</code>
</p>

<ul class="org-ul">
<li>Honesty is a trait that most parents greatly value in their children, as nothing is more troublesome than someone who lies to their parents.
</li>
<li>If you ever take a personality test or go to an interview, you may be asked what your most valuable trait is, and the best answer is usually something like willpower or honesty.
</li>
<li>Many intellectuals find their intelligence to be their most valuable trait, as they are more proud of that part of their character than anything else.
</li>
<li>If there is one trait that no one appreciates in a friend, it is deceitfulness, because a friend you cannot trust is no friend at all.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/trample-in-a-sentence/">Trample</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>to crush, disfigure, maim, etc., by walking or running over something</code>
</p>

<ul class="org-ul">
<li>The girl walked lightly through the garden, carefully watching her feet so that she didn’t trample the beautiful flowers.
</li>
<li>The concert was quickly filled with drunken party-goers and Layla knew that if she didn't leave now they were likely to trample her.
</li>
<li>Chaos erupted as the bombs went off and <b>in their desperation</b> <code>拼死</code> to escape, they couldn't help but to trample those who were too slow.
</li>
<li>After her boyfriend cheated on her, she wanted to trample him so she took all of his gifts and crushed them instead.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/tranquil-in-a-sentence/">Tranquil</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>relaxed; peaceful</code>
</p>

<ul class="org-ul">
<li>Since we were the only ones on the beach, we enjoyed a tranquil day.
</li>
<li>The doctor says I need to be in a tranquil place so I can relax.
</li>
<li>Surrounded by a beautiful waterfall and exotic flowers, how could Hiram feel anything but tranquil on his vacation?
</li>
<li>The yoga instructor will show us the best way to reach a tranquil state.
</li>
<li>When my little baby is sleeping peacefully, he wears a tranquil expression on his face.
</li>
<li>While some people hate being around their families, I am never more tranquil than when I am surrounded by those I love.
</li>
<li>In the emergency room, the doctor gave the agitated man a sedative to help him become tranquil.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/transcend-in-a-sentence/">Transcend</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>to exceed the limits of something</code>
</p>

<ul class="org-ul">
<li>The athlete hoped the increased training would allow him to transcend Olympic records.
</li>
<li>According to some religions, you will transcend the limits of this world and enter another world when you die.
</li>
<li>A good education will allow you to transcend many socioeconomic barriers.
</li>
<li>To transcend her need to sleep, the college student took caffeine pills during final exam week.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/transcendent-in-a-sentence/">Transcendent</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>surpassing the ordinary; exceptional</code>
</p>

<ul class="org-ul">
<li>In order to completely identify with the plot of the science fiction movie, you must be able to consider the idea of transcendent experiences that allow people to enter the minds of others.
</li>
<li>Experts are looking into the sequence of genetic alterations that allowed the transcendent mutation scientists recently discovered.
</li>
<li>To many, a god is a transcendent being who has powers that exceed those of mere mortals.
</li>
<li>The love-struck boy grew faint and felt as though he was having a transcendent occurrence every time he encountered the girl of his dreams.
</li>
<li>When the little boy played a transcendent tune on the flute, the snake started to weave from side to side and eventually returned to its basket.
</li>
<li>Beth describes her meeting with her favorite singer as a transcendent moment that changed her life.
</li>
<li>Out of all of the people who have attended the sacred temple, half of them claim to have had transcendent experiences with heavenly creatures.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/transcribe-in-a-sentence/">Transcribe</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>to change a form of communication into another form</code>
</p>

<ul class="org-ul">
<li>The medical transcriptionist will transcribe the doctor’s notes by typing them into the computer.
</li>
<li>When I finish my current project, I will transcribe all of the actor’s audiotapes and compile them into a written biography.
</li>
<li>The translator will transcribe the deaf girl’s gestures so everyone in court can understand what she is saying.
</li>
<li>Because I have sticky liquid on my hands, I will let my smartphone transcribe my vocal response into a text message.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/transcription-in-a-sentence/">Transcription</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>a written or printed representation of something</code>
</p>

<ul class="org-ul">
<li>You can listen to the audio version of the podcast or wait to read the transcription.
</li>
<li>A transcription of the client’s medical records was placed inside the file once copied.
</li>
<li>The attorney requested a transcription of all of the witness’s names and addresses.
</li>
<li>Burning the transcription, the crooked banker made sure to get rid of any record of his theft.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/transgress-in-a-sentence/">Transgress</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>to act in violation of some law</code>
</p>

<ul class="org-ul">
<li>People who transgress the boundaries of social etiquette will be politely turned away at the door.
</li>
<li>If all children were taught not to transgress the rules of common decency and good manners, the world would probably be a much better place for everyone.
</li>
<li>Because I am a <b>law abiding citizen</b>, I take great pains not to transgress the speed limit or other traffic regulations.
</li>
<li>After Luis agreed to the plan to transgress the dress code, he and his fellow rebels were suspended from school for three days.
</li>
<li>Despite a strong urge to transgress the boundaries set by his parents, Alan decided to avoid more trouble and stay in his room.
</li>
<li>He should have known better than to transgress the guidelines set down by the governing body.
</li>
<li>Although Belinda didn’t want to transgress the unwritten social code of her class, she did the right thing by reporting what was happening in the girls’ restroom.
</li>
</ul>
</div>
</div>
