ruby/T.org
* [[https://wordsinasentence.com/transitory-in-a-sentence/][Transitory]]

  =not permanent; temporary=

  - Unfortunately, the homeless people can only stay in the transitory shelter for a short period of time.
  - Jason is a playboy who has never had more than a transitory affection for any of his girlfriends.
  - Before being given a permanent assignment, the soldiers will receive several transitory positions so their skills can be evaluated for final job placement.
  - The gypsies prefer a transitory lifestyle that allows them to easily move one place to another.
  - Although the Smiths did not lose their home during the tornado, they still had to take up transitory residence in a hotel because of the power outage in their neighborhood.
  - Once this transitory rain is over, we can set out for our picnic.
  - My firm is looking for a few transitory workers who do not mind working for only a week or two.

* [[https://wordsinasentence.com/transmute-in-a-sentence/][Transmute]]

  =to change or alter appearance or form=

  - After years of therapy, the woman was able to transmute her negative thoughts into positive ones.
  - The alien’s ability to transmute it’s body into a liquid form shocked the NASA onlookers.
  - During the meeting, action was taken to transmute the outdated policy into a more updated plan.
  - You can transmute energy into another form, but it cannot be created or destroyed.

* [[https://wordsinasentence.com/treacherous-in-a-sentence/][Treacherous]]

  =unsafe=

  - Drivers are asked to stay home and avoid the treacherous icy roads.
  - At night, the winding roads can make driving up the mountain a treacherous journey.
  - Police officers should be paid more because working in law enforcement is a treacherous occupation.
  - Unless you are an expert skier, you should avoid the treacherous mountain known as the Skier Slayer.

* [[https://wordsinasentence.com/tread-in-a-sentence/][Tread]]

  =to walk, step, or trample with your feet=

  - In an effort to avoid waking her parents, the girl tread lightly through the entryway.
  - “Tread softly, “the camper warned, “We don’t want to wake sleeping bears.”
  - The children tried to tread on water but sunk down to the bottom over and over again.
  - Listening at the window, the frightened boy heard footsteps as soldiers tread towards the plantation.

* [[https://wordsinasentence.com/treatise-in-a-sentence/][Treatise]]

  =a serious book or piece of writing about some subject=

  - I read Josh’s treatise on the Civil War and found it to be very informative.
  - The doctor’s treatise was very formal and systematic, drawing much praise.
  - She wrote a furious treatise against all the corruption in government.
  - Ted’s treatise on zoology was thorough and systematic.

* [[https://wordsinasentence.com/trenchant-in-a-sentence/][Trenchant]]

  =sharp or cutting=

  - Marvin’s trenchant wit made him a popular speaker at conservative fundraisers.
  - Although the movie’s plot is exciting, the dialogue is boring and needs to be polished until it is more trenchant.
  - Sometimes your tone of voice is so trenchant that you come across as being a mean person.
  - Even though Kate is a trenchant person who knows a great deal, she does not always think fast on her feet.
  - The frustrated student wrote a trenchant essay about the inedible *lunchroom* food.
  - Because the reporter made a trenchant comment on the president’s policies, he was banned from all presidential events.
  - The short-tempered actress was known for being trenchant with her employees.

* [[https://wordsinasentence.com/trepidation-in-a-sentence/][Trepidation]]

  =a nervous or fearful feeling=

  - Shaking with trepidation, the young man faced his fear of heights by skydiving.
  - While everyone else in the room was scared of spiders, Robin had no sense of trepidation when the eight-legged critter crawled up the wall.
  - As the earthquake bared down, I was overpowered with trepidation.
  - I dread flying, so when the plane took off, my trepidation levels skyrocketed!
  - The young woman had a good deal of trepidation of dying while the senior citizen had a joy for living.
  - The recent neighborhood crime fills me with trepidation as my house could be targeted next.
  - When the lights flickered off, the children screamed in vain except one particular boy who did not exhibit any trepidation whatsoever.

* [[https://wordsinasentence.com/trespass-in-a-sentence/][Trespass]]

  =to enter someone else's property illegally=

  - Hoping no one would see him trespass, the hunter ignored the sign and headed in to the woods.
  - Although she realized it was a crime, the girl made it a habit to trespass through the abandoned building when she was bored.
  - Finding a way to trespass through the farmer’s *rickety*, wooden fence, the fox knew that dinner would come sooner than later.
  - With her picket sign in hand, the protester decided to trespass on the plant’s property was the only way to draw attention to the cause.

* [[https://wordsinasentence.com/tribulation-in-a-sentence/][Tribulation]]

  =a challenging situation or experience=

  - When creating his multimillion dollar software company, Mark learned from each tribulation he faced.
  - The season-ending injury was a huge tribulation for the athlete.
  - While we won the war, the battles were a tribulation for our soldiers.
  - Jim is hiring an expensive attorney because he believes this person can bring an end to the tribulation he is facing.

* [[https://wordsinasentence.com/tributary-in-a-sentence/][Tributary]]

  =a stream of water that enters into a larger body of water=

  - As it flowed into the river, the tributary provided fresh water for the village.
  - The women often washed their clothes in the small tributary that fed into the brook.
  - Do you think the polluted waters of the tributary will contaminate the river?
  - If the tributary floods, it may cause the river into which it empties to overflow as well.

* [[https://wordsinasentence.com/trickle-in-a-sentence/][Trickle]]

  =a very thin flow=

  - There was a slow trickle of water from the faucet in the bathroom.
  - Before it began to gush, the roof leak started off as a trickle.
  - The rain began to slowly trickle down the driver’s windshield.
  - A trickle of spilled juice rolled off the table.

