ruby/T.html


<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/transitory-in-a-sentence/">Transitory</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>not permanent; temporary</code>
</p>

<ul class="org-ul">
<li>Unfortunately, the homeless people can only stay in the transitory shelter for a short period of time.
</li>
<li>Jason is a playboy who has never had more than a transitory affection for any of his girlfriends.
</li>
<li>Before being given a permanent assignment, the soldiers will receive several transitory positions so their skills can be evaluated for final job placement.
</li>
<li>The gypsies prefer a transitory lifestyle that allows them to easily move one place to another.
</li>
<li>Although the Smiths did not lose their home during the tornado, they still had to take up transitory residence in a hotel because of the power outage in their neighborhood.
</li>
<li>Once this transitory rain is over, we can set out for our picnic.
</li>
<li>My firm is looking for a few transitory workers who do not mind working for only a week or two.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/transmute-in-a-sentence/">Transmute</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>to change or alter appearance or form</code>
</p>

<ul class="org-ul">
<li>After years of therapy, the woman was able to transmute her negative thoughts into positive ones.
</li>
<li>The alien’s ability to transmute it’s body into a liquid form shocked the NASA onlookers.
</li>
<li>During the meeting, action was taken to transmute the outdated policy into a more updated plan.
</li>
<li>You can transmute energy into another form, but it cannot be created or destroyed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/treacherous-in-a-sentence/">Treacherous</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>unsafe</code>
</p>

<ul class="org-ul">
<li>Drivers are asked to stay home and avoid the treacherous icy roads.
</li>
<li>At night, the winding roads can make driving up the mountain a treacherous journey.
</li>
<li>Police officers should be paid more because working in law enforcement is a treacherous occupation.
</li>
<li>Unless you are an expert skier, you should avoid the treacherous mountain known as the Skier Slayer.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/tread-in-a-sentence/">Tread</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>to walk, step, or trample with your feet</code>
</p>

<ul class="org-ul">
<li>In an effort to avoid waking her parents, the girl tread lightly through the entryway.
</li>
<li>“Tread softly, “the camper warned, “We don’t want to wake sleeping bears.”
</li>
<li>The children tried to tread on water but sunk down to the bottom over and over again.
</li>
<li>Listening at the window, the frightened boy heard footsteps as soldiers tread towards the plantation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/treatise-in-a-sentence/">Treatise</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>a serious book or piece of writing about some subject</code>
</p>

<ul class="org-ul">
<li>I read Josh’s treatise on the Civil War and found it to be very informative.
</li>
<li>The doctor’s treatise was very formal and systematic, drawing much praise.
</li>
<li>She wrote a furious treatise against all the corruption in government.
</li>
<li>Ted’s treatise on zoology was thorough and systematic.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/trenchant-in-a-sentence/">Trenchant</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>sharp or cutting</code>
</p>

<ul class="org-ul">
<li>Marvin’s trenchant wit made him a popular speaker at conservative fundraisers.
</li>
<li>Although the movie’s plot is exciting, the dialogue is boring and needs to be polished until it is more trenchant.
</li>
<li>Sometimes your tone of voice is so trenchant that you come across as being a mean person.
</li>
<li>Even though Kate is a trenchant person who knows a great deal, she does not always think fast on her feet.
</li>
<li>The frustrated student wrote a trenchant essay about the inedible <b>lunchroom</b> food.
</li>
<li>Because the reporter made a trenchant comment on the president’s policies, he was banned from all presidential events.
</li>
<li>The short-tempered actress was known for being trenchant with her employees.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/trepidation-in-a-sentence/">Trepidation</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>a nervous or fearful feeling</code>
</p>

<ul class="org-ul">
<li>Shaking with trepidation, the young man faced his fear of heights by skydiving.
</li>
<li>While everyone else in the room was scared of spiders, Robin had no sense of trepidation when the eight-legged critter crawled up the wall.
</li>
<li>As the earthquake bared down, I was overpowered with trepidation.
</li>
<li>I dread flying, so when the plane took off, my trepidation levels skyrocketed!
</li>
<li>The young woman had a good deal of trepidation of dying while the senior citizen had a joy for living.
</li>
<li>The recent neighborhood crime fills me with trepidation as my house could be targeted next.
</li>
<li>When the lights flickered off, the children screamed in vain except one particular boy who did not exhibit any trepidation whatsoever.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/trespass-in-a-sentence/">Trespass</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>to enter someone else's property illegally</code>
</p>

<ul class="org-ul">
<li>Hoping no one would see him trespass, the hunter ignored the sign and headed in to the woods.
</li>
<li>Although she realized it was a crime, the girl made it a habit to trespass through the abandoned building when she was bored.
</li>
<li>Finding a way to trespass through the farmer’s <b>rickety</b>, wooden fence, the fox knew that dinner would come sooner than later.
</li>
<li>With her picket sign in hand, the protester decided to trespass on the plant’s property was the only way to draw attention to the cause.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/tribulation-in-a-sentence/">Tribulation</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>a challenging situation or experience</code>
</p>

<ul class="org-ul">
<li>When creating his multimillion dollar software company, Mark learned from each tribulation he faced.
</li>
<li>The season-ending injury was a huge tribulation for the athlete.
</li>
<li>While we won the war, the battles were a tribulation for our soldiers.
</li>
<li>Jim is hiring an expensive attorney because he believes this person can bring an end to the tribulation he is facing.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/tributary-in-a-sentence/">Tributary</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>a stream of water that enters into a larger body of water</code>
</p>

<ul class="org-ul">
<li>As it flowed into the river, the tributary provided fresh water for the village.
</li>
<li>The women often washed their clothes in the small tributary that fed into the brook.
</li>
<li>Do you think the polluted waters of the tributary will contaminate the river?
</li>
<li>If the tributary floods, it may cause the river into which it empties to overflow as well.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/trickle-in-a-sentence/">Trickle</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>a very thin flow</code>
</p>

<ul class="org-ul">
<li>There was a slow trickle of water from the faucet in the bathroom.
</li>
<li>Before it began to gush, the roof leak started off as a trickle.
</li>
<li>The rain began to slowly trickle down the driver’s windshield.
</li>
<li>A trickle of spilled juice rolled off the table.
</li>
</ul>
</div>
</div>
