ruby/T.org
* [[https://wordsinasentence.com/trilogy-in-a-sentence/][Trilogy]]

  =a group of three things which are related=

  - The first book in the trilogy sets the course for the other two books in the series.
  - When the playwright wrote his trilogy of plays, he never imagined he’d be inspired to write a fourth play about the same characters.
  - The last movie in the trilogy of three films opens tomorrow.
  - The trilogy of novels covers the time period between the main character’s birth until his death in the third and final novel.

* [[https://wordsinasentence.com/trite-in-a-sentence/][Trite]]

  =unoriginal and lacking in importance=

  - I did not finish the novel because the story’s plot was trite and uninspiring.
  - At parties, I tend to avoid trite conversations because they are dull and do not reveal any new information.
  - The senator’s response to the unemployment question was trite and unconvincing.
  - Will you stop using those trite clichés?
  - Since the play is trite and unoriginal, I cannot imagine many people will go to see it.
  - The so-called ladies’ man often used trite phrases to flirt with women.
  - Although the movie concept was unique, the character dialogue was trite and ruined the picture.

* [[https://wordsinasentence.com/truce-in-a-sentence/][Truce]]

  =a time period in which opposing sides agree to stop fighting=

  - Hopefully the truce will last long enough for the leaders to agree to a peace treaty.
  - If the two generals agree to the holiday truce, there will be a ceasefire on Christmas Day.
  - Jose broke the gang truce by driving in the rival gang’s territory.
  - When the truce ends at noon tomorrow, it will only be a matter of time before gunfire is heard again.

* [[https://wordsinasentence.com/truculent-in-a-sentence/][Truculent]]

  =quick to fight or argue=

  - When my uncle drinks too much, he becomes very truculent and will fight anyone.
  - Why are you in such a truculent mood that you want to argue with everyone today?
  - On Monday, the truculent bully made the mistake of starting a fight with someone who could hit harder than him.
  - My truculent boyfriend is in a bad mood because I did not respond to his text message last night.
  - When you do not give Janice everything she wants, she becomes truculent and tries to argue with you.
  - Nuns are true lovers of peace and are never truculent with others.
  - Because the teacher did not want the truculent student to disturb others, she made him sit next to her desk.

* [[https://wordsinasentence.com/turbulent-in-a-sentence/][Turbulent]]

  =being in a wild or disordered state=

  - Race relations in the town were quite turbulent after the white police officer was not indicted for killing the unarmed minority.
  - Because of my turbulent history with my mother, I find it difficult to establish lasting relationships with women.
  - The recession is going to cause turbulent times for families who are already struggling to pay their bills.
  - After my parent’s turbulent marriage came to an end, we finally had peace in our house.

* [[https://wordsinasentence.com/turmoil-in-a-sentence/][Turmoil]]

  =a state of confusion or disorder=

  - The mayor was not reelected to his office because of his inability to bring the city out of financial turmoil.
  - When the inexperienced teacher realized she could not handle the turmoil in her classroom, she ran out of the door.
  - The turmoil after the war led to the formation of rival groups who all wanted to run the small country.
  - During the riots, there was widespread turmoil in the city.
  - Because of the financial turmoil in our country, many people are losing their homes due to bank foreclosure.
  - When the housing bubble burst, there was a great deal of turmoil experienced by real estate agents who depended on sales for a living.
  - For many young adults, the teenage years are ones of turmoil in which they are often confused about who they are.





* [[https://wordsinasentence.com/tyrant-in-a-sentence/][Tyrant]]

  =an individual who governs unfairly and brutally=

  - Growing up I considered my stepmother to be a tyrant because she punished me without cause.
  - A majority of the country’s people have decided to rise up against the tyrant who kills anyone he views as a threat to his power.
  - Because my tyrant of a supervisor makes me work late most nights, I am thinking about quitting my job.
  - Our country’s military is assisting in the effort to overthrow the tyrant who is brutalizing our neighboring country.

* [[https://wordsinasentence.com/taciturn-in-a-sentence/][Taciturn]]

  =reserved or uncommunicative in speech; saying little=

  - My shy brother is taciturn and rarely speaks in public.
  - Although my grandfather was a taciturn man who spoke infrequently, he was a man people readily followed.
  - By nature, Sheila is a taciturn woman who keeps her thoughts to herself.
  - When Jack drinks, he goes from being taciturn to being very outspoken.
  - Because I have a really bad temper, I remain taciturn during an argument so I will not say words I will later regret.
  - Mr. Jones is my taciturn business partner who hardly ever speaks during our board meetings.
  - If you want to be a politician, you need to be chatty not taciturn.

* [[https://wordsinasentence.com/tally-in-a-sentence/][Tally]]

  =a count that usually represents a score, money, number of wins, etc=

  - The prisoner kept a running tally of his incarceration by marking his cell wall with a white line for each day he spent behind bars.
  - Before there were calculators, merchant would use an abacus to tally up debts owed.
  - It was once common practice for customers and sellers to own duplicate tally sticks where each notch in the wood represented a specific amount of money owed.
  - After the final round, the nervous gymnasts waited impatiently for the judges to tally their scores.


* [[https://wordsinasentence.com/tame-in-a-sentence/][Tame]]

  =domesticated, gentle, behavior exhibited after loss of savage ways=

  - After several weeks of training, the poorly behaved and hyperactive puppy was surprisingly tame.
  - When David first brought the injured baby bear into his home it snarled and slashed, but after it grew accustomed to David’s presence it became gentle and tame.
  - The wild tiger lost its fight after a few days in the cage and eventually became tame.
  - Typically vicious animals like leopards are uncharacteristically tame when bred in captivity.


