ruby/T.html

<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/trilogy-in-a-sentence/">Trilogy</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>a group of three things which are related</code>
</p>

<ul class="org-ul">
<li>The first book in the trilogy sets the course for the other two books in the series.
</li>
<li>When the playwright wrote his trilogy of plays, he never imagined he’d be inspired to write a fourth play about the same characters.
</li>
<li>The last movie in the trilogy of three films opens tomorrow.
</li>
<li>The trilogy of novels covers the time period between the main character’s birth until his death in the third and final novel.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/trite-in-a-sentence/">Trite</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>unoriginal and lacking in importance</code>
</p>

<ul class="org-ul">
<li>I did not finish the novel because the story’s plot was trite and uninspiring.
</li>
<li>At parties, I tend to avoid trite conversations because they are dull and do not reveal any new information.
</li>
<li>The senator’s response to the unemployment question was trite and unconvincing.
</li>
<li>Will you stop using those trite clichés?
</li>
<li>Since the play is trite and unoriginal, I cannot imagine many people will go to see it.
</li>
<li>The so-called ladies’ man often used trite phrases to flirt with women.
</li>
<li>Although the movie concept was unique, the character dialogue was trite and ruined the picture.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/truce-in-a-sentence/">Truce</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>a time period in which opposing sides agree to stop fighting</code>
</p>

<ul class="org-ul">
<li>Hopefully the truce will last long enough for the leaders to agree to a peace treaty.
</li>
<li>If the two generals agree to the holiday truce, there will be a ceasefire on Christmas Day.
</li>
<li>Jose broke the gang truce by driving in the rival gang’s territory.
</li>
<li>When the truce ends at noon tomorrow, it will only be a matter of time before gunfire is heard again.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/truculent-in-a-sentence/">Truculent</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>quick to fight or argue</code>
</p>

<ul class="org-ul">
<li>When my uncle drinks too much, he becomes very truculent and will fight anyone.
</li>
<li>Why are you in such a truculent mood that you want to argue with everyone today?
</li>
<li>On Monday, the truculent bully made the mistake of starting a fight with someone who could hit harder than him.
</li>
<li>My truculent boyfriend is in a bad mood because I did not respond to his text message last night.
</li>
<li>When you do not give Janice everything she wants, she becomes truculent and tries to argue with you.
</li>
<li>Nuns are true lovers of peace and are never truculent with others.
</li>
<li>Because the teacher did not want the truculent student to disturb others, she made him sit next to her desk.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> <a href="https://wordsinasentence.com/turbulent-in-a-sentence/">Turbulent</a></h2>
<div class="outline-text-2" id="text-64">
<p>
<code>being in a wild or disordered state</code>
</p>

<ul class="org-ul">
<li>Race relations in the town were quite turbulent after the white police officer was not indicted for killing the unarmed minority.
</li>
<li>Because of my turbulent history with my mother, I find it difficult to establish lasting relationships with women.
</li>
<li>The recession is going to cause turbulent times for families who are already struggling to pay their bills.
</li>
<li>After my parent’s turbulent marriage came to an end, we finally had peace in our house.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/turmoil-in-a-sentence/">Turmoil</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>a state of confusion or disorder</code>
</p>

<ul class="org-ul">
<li>The mayor was not reelected to his office because of his inability to bring the city out of financial turmoil.
</li>
<li>When the inexperienced teacher realized she could not handle the turmoil in her classroom, she ran out of the door.
</li>
<li>The turmoil after the war led to the formation of rival groups who all wanted to run the small country.
</li>
<li>During the riots, there was widespread turmoil in the city.
</li>
<li>Because of the financial turmoil in our country, many people are losing their homes due to bank foreclosure.
</li>
<li>When the housing bubble burst, there was a great deal of turmoil experienced by real estate agents who depended on sales for a living.
</li>
<li>For many young adults, the teenage years are ones of turmoil in which they are often confused about who they are.
</li>
</ul>
</div>
</div>





<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/tyrant-in-a-sentence/">Tyrant</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>an individual who governs unfairly and brutally</code>
</p>

<ul class="org-ul">
<li>Growing up I considered my stepmother to be a tyrant because she punished me without cause.
</li>
<li>A majority of the country’s people have decided to rise up against the tyrant who kills anyone he views as a threat to his power.
</li>
<li>Because my tyrant of a supervisor makes me work late most nights, I am thinking about quitting my job.
</li>
<li>Our country’s military is assisting in the effort to overthrow the tyrant who is brutalizing our neighboring country.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/taciturn-in-a-sentence/">Taciturn</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>reserved or uncommunicative in speech; saying little</code>
</p>

<ul class="org-ul">
<li>My shy brother is taciturn and rarely speaks in public.
</li>
<li>Although my grandfather was a taciturn man who spoke infrequently, he was a man people readily followed.
</li>
<li>By nature, Sheila is a taciturn woman who keeps her thoughts to herself.
</li>
<li>When Jack drinks, he goes from being taciturn to being very outspoken.
</li>
<li>Because I have a really bad temper, I remain taciturn during an argument so I will not say words I will later regret.
</li>
<li>Mr. Jones is my taciturn business partner who hardly ever speaks during our board meetings.
</li>
<li>If you want to be a politician, you need to be chatty not taciturn.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/tally-in-a-sentence/">Tally</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>a count that usually represents a score, money, number of wins, etc</code>
</p>

<ul class="org-ul">
<li>The prisoner kept a running tally of his incarceration by marking his cell wall with a white line for each day he spent behind bars.
</li>
<li>Before there were calculators, merchant would use an abacus to tally up debts owed.
</li>
<li>It was once common practice for customers and sellers to own duplicate tally sticks where each notch in the wood represented a specific amount of money owed.
</li>
<li>After the final round, the nervous gymnasts waited impatiently for the judges to tally their scores.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/tame-in-a-sentence/">Tame</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>domesticated, gentle, behavior exhibited after loss of savage ways</code>
</p>

<ul class="org-ul">
<li>After several weeks of training, the poorly behaved and hyperactive puppy was surprisingly tame.
</li>
<li>When David first brought the injured baby bear into his home it snarled and slashed, but after it grew accustomed to David’s presence it became gentle and tame.
</li>
<li>The wild tiger lost its fight after a few days in the cage and eventually became tame.
</li>
<li>Typically vicious animals like leopards are uncharacteristically tame when bred in captivity.
</li>
</ul>
</div>
</div>
