ruby/T.org
* [[https://wordsinasentence.com/tantrum-in-a-sentence/][Tantrum]]

  =a fit or outburst of extreme emotion that is often deemed childish=

  - The toddler threw a temper tantrum when his mother took away his favorite toy.
  - The soccer player had a tantrum and stomped across the field after the referee made a poor call.
  - After his girlfriend broke up with him, he had a tantrum and tore all of their pictures to shreds.
  - The young mother cringed every time her child had a temper tantrum in public because he usually threw himself on the floor and screamed.

* [[https://wordsinasentence.com/tarry-in-a-sentence-2/][Tarry]]

  =to take your time or delay in doing something=

  - He decided to tarry during his trip to Georgia because he really didn’t want to go, but he was only able to stall for a short while.
  - If you tarry while doing your work it will simply take even longer, so it is best to just get it over with and not wait.
  - We shouldn’t tarry in these dangerous woods any longer than we have to, as we are in more danger the longer we are here.
  - It’s a bad idea to tarry when you have important places to be, because it is always best to be punctual and arrive on time.

* [[https://wordsinasentence.com/tart-in-a-sentence/][Tart]]

  =acid or sharp in taste=

  - The sour candy I eat is very tart and I love it, but my mom that hates sour food does not.
  - People who prefer sweet foods usually don’t like things that are tart, such as lemons or sour candy.
  - Cherries are very tart compared to strawberries, which is why some sweet tooth individuals don’t like them.
  - If you want to drink something tart on a hot summer day, lemonade is your best bet.




* [[https://wordsinasentence.com/teeter-in-a-sentence/][Teeter]]

  =to be unsteady or to wobble=

  - The judges held their breaths as they watched the normally skilled gymnast teeter on the edge of the balance beam.
  - Jane was so distracted by her book that she put her coffee cup on the edge of the table and she watched it teeter for a moment before crashing to the floor.
  - The toddler finally stood up and within seconds began to teeter on his unsteady feet.
  - When she pulled the piece from the Jenga puzzle, its foundation began to teeter and eventually crashed into a heap of wood blocks.


* [[https://wordsinasentence.com/temerity-in-a-sentence/][Temerity]]

  =excessive confidence or boldness; audacity=

  - We were shocked Ann Marie had the temerity to challenge our teacher’s authority in class.
  - Because they feel their doctors are more educated than they are, most patients do not have the temerity to challenge their medical diagnosis.
  - Despite being ordered to stay away from his wife by the court, Jason still had the temerity to go to her apartment.
  - Misbehaved children have the temerity to challenge rules.
  - All it will take for the world to change is for people to display the temerity necessary to stand up to tyranny.
  - The teenager’s temerity led him to do dangerous things, like driving recklessly.
  - Even though the mayor’s advisors were against his budget proposal, none of them had the temerity to admit it to him.

* [[https://wordsinasentence.com/tempest-in-a-sentence/][Tempest]]

  =stormy weather=

  - The tempest has replaced the sunlight and caused us to move our picnic indoors.
  - Days before the hurricane hit land, the government urged citizens to prepare for the tempest.
  - The tempest of lightning caused the barn to burn to the ground.
  - During the tempest, the hail came down with a powerful force and broke two of my car windows.

* [[https://wordsinasentence.com/tempestuous-in-a-sentence/][Tempestuous]]

  =identified by stormy or explosive conditions=

  - My father’s tempestuous mood often leaves my mother in tears.
  - Because forecasters predict tempestuous weather for tomorrow, we should delay our boat trip for another day.
  - The clouds look rather tempestuous today and lead me to think a storm is coming.
  - During the hurricane, the ocean waters became quite tempestuous.
  - The tempestuous winds easily uprooted the huge tree from our yard.
  - Although Cara and Scarlett were once friends, they now have a tempestuous relationship and rarely speak to each other.
  - By the time the tempestuous argument was over, John had a bloody nose.

* [[https://wordsinasentence.com/temporize-in-a-sentence/][Temporize]]

  =to lengthen a discussion in order to have additional time to think or negotiate=

  - Because we could not reach an agreement, we chose to break for refreshments in order to temporize.
  - The hostage negotiator has no choice but to temporize with the kidnapper by offering to send in food and drinks.
  - In hopes of moving their test to next week, the students will temporize at the beginning of class.
  - My persistent daughter will try to temporize when we refuse to extend her curfew.

* [[https://wordsinasentence.com/testy-in-a-sentence/][Testy]]

  =easily ticked off or irritated=

  - My husband is often testy and in a bad mood after a hard day at work.
  - When Jared is tired and irritable, he can be quite testy about small things.
  - Throughout the broadcast, the judge was testy and appeared easily irritated.
  - Because the actor likes his privacy, he gets testy when reporters question him about his family.

* [[https://wordsinasentence.com/thaw-in-a-sentence/][Thaw]]

  =to melt or defrost=

  - If you leave ice out of the freezer, it will thaw into a messy puddle of water.
  - Frozen foods usually require them to thaw for at least twenty minutes before putting it in the oven.
  - A small puddle of water pooled on the countertop due to my mother leaving the frozen pack of ground beef to thaw.
  - Chef Peterman used the microwave at the restaurant to thaw a small pack of steaks so he could quickly get them on the grill.

* [[https://wordsinasentence.com/thermal-in-a-sentence/][Thermal]]

  =heat related=

  - Venturing out into the thermal pool, the swimmer let out a sigh of relief as the hot water eased her aching back.
  - Thermal materials were used when building the house to keep the inside of the home warm during the winter.
  - Many of the campers wore warm thermal underwear to keep themselves from freezing on the trip.
  - The middle schoolers designed a thermal energy project that showed how heat moves through a home.

