ruby/T.html


<div id="outline-container-sec-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/tantrum-in-a-sentence/">Tantrum</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>a fit or outburst of extreme emotion that is often deemed childish</code>
</p>

<ul class="org-ul">
<li>The toddler threw a temper tantrum when his mother took away his favorite toy.
</li>
<li>The soccer player had a tantrum and stomped across the field after the referee made a poor call.
</li>
<li>After his girlfriend broke up with him, he had a tantrum and tore all of their pictures to shreds.
</li>
<li>The young mother cringed every time her child had a temper tantrum in public because he usually threw himself on the floor and screamed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/tarry-in-a-sentence-2/">Tarry</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>to take your time or delay in doing something</code>
</p>

<ul class="org-ul">
<li>He decided to tarry during his trip to Georgia because he really didn’t want to go, but he was only able to stall for a short while.
</li>
<li>If you tarry while doing your work it will simply take even longer, so it is best to just get it over with and not wait.
</li>
<li>We shouldn’t tarry in these dangerous woods any longer than we have to, as we are in more danger the longer we are here.
</li>
<li>It’s a bad idea to tarry when you have important places to be, because it is always best to be punctual and arrive on time.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> <a href="https://wordsinasentence.com/tart-in-a-sentence/">Tart</a></h2>
<div class="outline-text-2" id="text-72">
<p>
<code>acid or sharp in taste</code>
</p>

<ul class="org-ul">
<li>The sour candy I eat is very tart and I love it, but my mom that hates sour food does not.
</li>
<li>People who prefer sweet foods usually don’t like things that are tart, such as lemons or sour candy.
</li>
<li>Cherries are very tart compared to strawberries, which is why some sweet tooth individuals don’t like them.
</li>
<li>If you want to drink something tart on a hot summer day, lemonade is your best bet.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-73" class="outline-2">
<h2 id="sec-73"><span class="section-number-2">73</span> <a href="https://wordsinasentence.com/teeter-in-a-sentence/">Teeter</a></h2>
<div class="outline-text-2" id="text-73">
<p>
<code>to be unsteady or to wobble</code>
</p>

<ul class="org-ul">
<li>The judges held their breaths as they watched the normally skilled gymnast teeter on the edge of the balance beam.
</li>
<li>Jane was so distracted by her book that she put her coffee cup on the edge of the table and she watched it teeter for a moment before crashing to the floor.
</li>
<li>The toddler finally stood up and within seconds began to teeter on his unsteady feet.
</li>
<li>When she pulled the piece from the Jenga puzzle, its foundation began to teeter and eventually crashed into a heap of wood blocks.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/temerity-in-a-sentence/">Temerity</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>excessive confidence or boldness; audacity</code>
</p>

<ul class="org-ul">
<li>We were shocked Ann Marie had the temerity to challenge our teacher’s authority in class.
</li>
<li>Because they feel their doctors are more educated than they are, most patients do not have the temerity to challenge their medical diagnosis.
</li>
<li>Despite being ordered to stay away from his wife by the court, Jason still had the temerity to go to her apartment.
</li>
<li>Misbehaved children have the temerity to challenge rules.
</li>
<li>All it will take for the world to change is for people to display the temerity necessary to stand up to tyranny.
</li>
<li>The teenager’s temerity led him to do dangerous things, like driving recklessly.
</li>
<li>Even though the mayor’s advisors were against his budget proposal, none of them had the temerity to admit it to him.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/tempest-in-a-sentence/">Tempest</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>stormy weather</code>
</p>

<ul class="org-ul">
<li>The tempest has replaced the sunlight and caused us to move our picnic indoors.
</li>
<li>Days before the hurricane hit land, the government urged citizens to prepare for the tempest.
</li>
<li>The tempest of lightning caused the barn to burn to the ground.
</li>
<li>During the tempest, the hail came down with a powerful force and broke two of my car windows.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> <a href="https://wordsinasentence.com/tempestuous-in-a-sentence/">Tempestuous</a></h2>
<div class="outline-text-2" id="text-76">
<p>
<code>identified by stormy or explosive conditions</code>
</p>

<ul class="org-ul">
<li>My father’s tempestuous mood often leaves my mother in tears.
</li>
<li>Because forecasters predict tempestuous weather for tomorrow, we should delay our boat trip for another day.
</li>
<li>The clouds look rather tempestuous today and lead me to think a storm is coming.
</li>
<li>During the hurricane, the ocean waters became quite tempestuous.
</li>
<li>The tempestuous winds easily uprooted the huge tree from our yard.
</li>
<li>Although Cara and Scarlett were once friends, they now have a tempestuous relationship and rarely speak to each other.
</li>
<li>By the time the tempestuous argument was over, John had a bloody nose.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> <a href="https://wordsinasentence.com/temporize-in-a-sentence/">Temporize</a></h2>
<div class="outline-text-2" id="text-77">
<p>
<code>to lengthen a discussion in order to have additional time to think or negotiate</code>
</p>

<ul class="org-ul">
<li>Because we could not reach an agreement, we chose to break for refreshments in order to temporize.
</li>
<li>The hostage negotiator has no choice but to temporize with the kidnapper by offering to send in food and drinks.
</li>
<li>In hopes of moving their test to next week, the students will temporize at the beginning of class.
</li>
<li>My persistent daughter will try to temporize when we refuse to extend her curfew.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> <a href="https://wordsinasentence.com/testy-in-a-sentence/">Testy</a></h2>
<div class="outline-text-2" id="text-78">
<p>
<code>easily ticked off or irritated</code>
</p>

<ul class="org-ul">
<li>My husband is often testy and in a bad mood after a hard day at work.
</li>
<li>When Jared is tired and irritable, he can be quite testy about small things.
</li>
<li>Throughout the broadcast, the judge was testy and appeared easily irritated.
</li>
<li>Because the actor likes his privacy, he gets testy when reporters question him about his family.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> <a href="https://wordsinasentence.com/thaw-in-a-sentence/">Thaw</a></h2>
<div class="outline-text-2" id="text-79">
<p>
<code>to melt or defrost</code>
</p>

<ul class="org-ul">
<li>If you leave ice out of the freezer, it will thaw into a messy puddle of water.
</li>
<li>Frozen foods usually require them to thaw for at least twenty minutes before putting it in the oven.
</li>
<li>A small puddle of water pooled on the countertop due to my mother leaving the frozen pack of ground beef to thaw.
</li>
<li>Chef Peterman used the microwave at the restaurant to thaw a small pack of steaks so he could quickly get them on the grill.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> <a href="https://wordsinasentence.com/thermal-in-a-sentence/">Thermal</a></h2>
<div class="outline-text-2" id="text-80">
<p>
<code>heat related</code>
</p>

<ul class="org-ul">
<li>Venturing out into the thermal pool, the swimmer let out a sigh of relief as the hot water eased her aching back.
</li>
<li>Thermal materials were used when building the house to keep the inside of the home warm during the winter.
</li>
<li>Many of the campers wore warm thermal underwear to keep themselves from freezing on the trip.
</li>
<li>The middle schoolers designed a thermal energy project that showed how heat moves through a home.
</li>
</ul>
</div>
</div>
