ruby/T.org
* [[https://wordsinasentence.com/thespian-in-a-sentence/][Thespian]]

  =relating to drama or the theater=

  - Making his thespian debut, the newbie took the stage and gave the theatrical performance of a lifetime.
  - The woman’s thespian dreams ended the day she was booed from the stage while giving a horrible monologue.
  - Studying all things thespian, the Broadway actress always had her nose in a book that would help her improve her craft.
  - The thespian society was created to honor high school students who stand out in drama productions.

* [[https://wordsinasentence.com/thrash-in-a-sentence/][Thrash]]

  =to hit or strike continuously=

  - When the pit bull dog began to bite the child’s leg, the father began to thrash the dog with a stick to get it to release its grip.
  - Wind and rain tended to thrash against the side of the house creating a repeated smacking sound.
  - Whenever the hot-tempered man got mad, he would thrash his body against the side of his house.
  - Instead of kneading the dough, the baker would thrash the dough over and over again onto the counter.

* [[https://wordsinasentence.com/threadbare-in-a-sentence/][Threadbare]]

  =pertaining to something that is worn out or ragged=

  - After living in the woods for a week without supplies, my threadbare clothing was not protecting me from the elements.
  - The only items for sale at the terrible garage sale were broken furniture, threadbare clothes and obsolete televisions.
  - With only a threadbare t-shirt and shorts, the girl was sent home from school to change into something that covered more.
  - Even though the jeans looked threadbare, the used “look” was actually in fashion this season.

* [[https://wordsinasentence.com/throes-in-a-sentence/][Throes]]

  =intense struggle or agony=

  - We decided to have our dog put down because he was in the throes of incurable pain.
  - In the throes of adoration, Bill texted Ann at least one hundred times a day.
  - Jack was incredibly suspicious when he was in the throes of jealousy.
  - During the throes of the revolution, over a thousand people were killed.

* [[https://wordsinasentence.com/throng-in-a-sentence/][Throng]]

  =a large cluster of individuals=

  - When the game ended, a throng of fans carried some of the winning players off the field.
  - The celebrity asked his bodyguard to clear him a pathway through the throng of fans blocking the theater entrance.
  - As soon as the store opened at 5 am, a throng of customers rushed through the doors to get the limited deals.
  - Because the restaurant was not expecting such a throng of consumers on Saturday morning, it did not have enough biscuits on hand to meet the demand.
  - The owner of the store was happy to see a throng of tourists inside her souvenir shop.
  - Although the street is partially blocked by the throng of people waiting to see the president, it can easily be cleared by the two policemen on horseback.
  - The throng of mourners filled the small church to capacity.

* [[https://wordsinasentence.com/thrust-in-a-sentence/][Thrust]]

  =to force something in a certain direction=

  - Sometimes, the wind will be so strong that it will thrust open an unlocked door to a building or house.
  - During an altercation, one girl began to thrust her hand into the other girl’s face to get her to stop yelling at her.
  - “Thrust the sword into your opponent with all your strength,” the leader told the other knights.
  - To catch a fish, the savage was taught by his tribal leader to thrust the spear at an angle down into the water.

* [[https://wordsinasentence.com/thump-in-a-sentence/][Thump]]

  =to tap something hard=

  - Many shoppers will thump a watermelon to see if it is ripe while grocery shopping in the produce section of the store.
  - At first a flick on the window pane did not get the attention of the girl inside, so the boy decided to thump the window with his fist.
  - In order to insinuate that somebody was knocking at the door, the little girl decided to thump on the wooden table next to her.
  - To get her friend’s attention, Leslie would thump her arm leaving a slight bruise behind.


* [[https://wordsinasentence.com/tiff-in-a-sentence/][Tiff]]

  =a small conflict usually between two people=

  - What started as a little tiff between the two sisters turned into a fight with hair-pulling and slapping.
  - As the two women were in a tiff about the movie they were going to go see, people in the theater’s lobby began to stare at them.
  - Since the driver’s focus was distracted by the tiff he was having with his passenger, he got into an accident.
  - Even though the couple were not speaking to each other following the tiff, everyone knew they would get back together.



* [[https://wordsinasentence.com/tilt-in-a-sentence/][Tilt]]

  =to slant or list to one side=

  - If you put a heavy object onto the table, it will tilt to the right since the top of it isn’t screwed in properly.
  - During the yoga exercise, the instructor directed her students to tilt their bodies in place without leaning against the wall.
  - Whenever my dog doesn’t understand what I am saying or doing, she will look at me straight in the eye and tilt her head.
  - To get the ketchup out of a glass bottle, it is recommended that you tilt the bottle at a 45-degree angle and hit the bottom of the bottle.

* [[https://wordsinasentence.com/tinder-in-a-sentence/][Tinder]]

  =a very flammable substance adaptable for use as kindling=

  - Lighting the tinder and wood, the camper prepared for an overnight stay at the campground.
  - As he walked through the woods, the boy always kept an eye out for tinder to collect for a fire.
  - Although they had tinder to get the fire going, he brought lighter fluid along as well.
  - Carrying sticks and tinder in his water-proof container, the hiker waited for the rain to pass before lighting a fire.

* [[https://wordsinasentence.com/tinge-in-a-sentence/][Tinge]]

  =a small but noticeable amount=

  - After kissing his wife, Jim had a tinge of lipstick on his lips.
  - The yellow tinge of Eli’s skin suggests he may have jaundice.
  - Because I was going to miss my family, I felt a tinge of sadness as I drove to college.
  - Reading the essay became less of a chore when I realized it contained a tinge of humor.


