ruby/T.html

<div id="outline-container-sec-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/thespian-in-a-sentence/">Thespian</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>relating to drama or the theater</code>
</p>

<ul class="org-ul">
<li>Making his thespian debut, the newbie took the stage and gave the theatrical performance of a lifetime.
</li>
<li>The woman’s thespian dreams ended the day she was booed from the stage while giving a horrible monologue.
</li>
<li>Studying all things thespian, the Broadway actress always had her nose in a book that would help her improve her craft.
</li>
<li>The thespian society was created to honor high school students who stand out in drama productions.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/thrash-in-a-sentence/">Thrash</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>to hit or strike continuously</code>
</p>

<ul class="org-ul">
<li>When the pit bull dog began to bite the child’s leg, the father began to thrash the dog with a stick to get it to release its grip.
</li>
<li>Wind and rain tended to thrash against the side of the house creating a repeated smacking sound.
</li>
<li>Whenever the hot-tempered man got mad, he would thrash his body against the side of his house.
</li>
<li>Instead of kneading the dough, the baker would thrash the dough over and over again onto the counter.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/threadbare-in-a-sentence/">Threadbare</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>pertaining to something that is worn out or ragged</code>
</p>

<ul class="org-ul">
<li>After living in the woods for a week without supplies, my threadbare clothing was not protecting me from the elements.
</li>
<li>The only items for sale at the terrible garage sale were broken furniture, threadbare clothes and obsolete televisions.
</li>
<li>With only a threadbare t-shirt and shorts, the girl was sent home from school to change into something that covered more.
</li>
<li>Even though the jeans looked threadbare, the used “look” was actually in fashion this season.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-84" class="outline-2">
<h2 id="sec-84"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/throes-in-a-sentence/">Throes</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>intense struggle or agony</code>
</p>

<ul class="org-ul">
<li>We decided to have our dog put down because he was in the throes of incurable pain.
</li>
<li>In the throes of adoration, Bill texted Ann at least one hundred times a day.
</li>
<li>Jack was incredibly suspicious when he was in the throes of jealousy.
</li>
<li>During the throes of the revolution, over a thousand people were killed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-85" class="outline-2">
<h2 id="sec-85"><span class="section-number-2">85</span> <a href="https://wordsinasentence.com/throng-in-a-sentence/">Throng</a></h2>
<div class="outline-text-2" id="text-85">
<p>
<code>a large cluster of individuals</code>
</p>

<ul class="org-ul">
<li>When the game ended, a throng of fans carried some of the winning players off the field.
</li>
<li>The celebrity asked his bodyguard to clear him a pathway through the throng of fans blocking the theater entrance.
</li>
<li>As soon as the store opened at 5 am, a throng of customers rushed through the doors to get the limited deals.
</li>
<li>Because the restaurant was not expecting such a throng of consumers on Saturday morning, it did not have enough biscuits on hand to meet the demand.
</li>
<li>The owner of the store was happy to see a throng of tourists inside her souvenir shop.
</li>
<li>Although the street is partially blocked by the throng of people waiting to see the president, it can easily be cleared by the two policemen on horseback.
</li>
<li>The throng of mourners filled the small church to capacity.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-86" class="outline-2">
<h2 id="sec-86"><span class="section-number-2">86</span> <a href="https://wordsinasentence.com/thrust-in-a-sentence/">Thrust</a></h2>
<div class="outline-text-2" id="text-86">
<p>
<code>to force something in a certain direction</code>
</p>

<ul class="org-ul">
<li>Sometimes, the wind will be so strong that it will thrust open an unlocked door to a building or house.
</li>
<li>During an altercation, one girl began to thrust her hand into the other girl’s face to get her to stop yelling at her.
</li>
<li>“Thrust the sword into your opponent with all your strength,” the leader told the other knights.
</li>
<li>To catch a fish, the savage was taught by his tribal leader to thrust the spear at an angle down into the water.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-87" class="outline-2">
<h2 id="sec-87"><span class="section-number-2">87</span> <a href="https://wordsinasentence.com/thump-in-a-sentence/">Thump</a></h2>
<div class="outline-text-2" id="text-87">
<p>
<code>to tap something hard</code>
</p>

<ul class="org-ul">
<li>Many shoppers will thump a watermelon to see if it is ripe while grocery shopping in the produce section of the store.
</li>
<li>At first a flick on the window pane did not get the attention of the girl inside, so the boy decided to thump the window with his fist.
</li>
<li>In order to insinuate that somebody was knocking at the door, the little girl decided to thump on the wooden table next to her.
</li>
<li>To get her friend’s attention, Leslie would thump her arm leaving a slight bruise behind.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-88" class="outline-2">
<h2 id="sec-88"><span class="section-number-2">88</span> <a href="https://wordsinasentence.com/tiff-in-a-sentence/">Tiff</a></h2>
<div class="outline-text-2" id="text-88">
<p>
<code>a small conflict usually between two people</code>
</p>

<ul class="org-ul">
<li>What started as a little tiff between the two sisters turned into a fight with hair-pulling and slapping.
</li>
<li>As the two women were in a tiff about the movie they were going to go see, people in the theater’s lobby began to stare at them.
</li>
<li>Since the driver’s focus was distracted by the tiff he was having with his passenger, he got into an accident.
</li>
<li>Even though the couple were not speaking to each other following the tiff, everyone knew they would get back together.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-89" class="outline-2">
<h2 id="sec-89"><span class="section-number-2">89</span> <a href="https://wordsinasentence.com/tilt-in-a-sentence/">Tilt</a></h2>
<div class="outline-text-2" id="text-89">
<p>
<code>to slant or list to one side</code>
</p>

<ul class="org-ul">
<li>If you put a heavy object onto the table, it will tilt to the right since the top of it isn’t screwed in properly.
</li>
<li>During the yoga exercise, the instructor directed her students to tilt their bodies in place without leaning against the wall.
</li>
<li>Whenever my dog doesn’t understand what I am saying or doing, she will look at me straight in the eye and tilt her head.
</li>
<li>To get the ketchup out of a glass bottle, it is recommended that you tilt the bottle at a 45-degree angle and hit the bottom of the bottle.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-90" class="outline-2">
<h2 id="sec-90"><span class="section-number-2">90</span> <a href="https://wordsinasentence.com/tinder-in-a-sentence/">Tinder</a></h2>
<div class="outline-text-2" id="text-90">
<p>
<code>a very flammable substance adaptable for use as kindling</code>
</p>

<ul class="org-ul">
<li>Lighting the tinder and wood, the camper prepared for an overnight stay at the campground.
</li>
<li>As he walked through the woods, the boy always kept an eye out for tinder to collect for a fire.
</li>
<li>Although they had tinder to get the fire going, he brought lighter fluid along as well.
</li>
<li>Carrying sticks and tinder in his water-proof container, the hiker waited for the rain to pass before lighting a fire.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-91" class="outline-2">
<h2 id="sec-91"><span class="section-number-2">91</span> <a href="https://wordsinasentence.com/tinge-in-a-sentence/">Tinge</a></h2>
<div class="outline-text-2" id="text-91">
<p>
<code>a small but noticeable amount</code>
</p>

<ul class="org-ul">
<li>After kissing his wife, Jim had a tinge of lipstick on his lips.
</li>
<li>The yellow tinge of Eli’s skin suggests he may have jaundice.
</li>
<li>Because I was going to miss my family, I felt a tinge of sadness as I drove to college.
</li>
<li>Reading the essay became less of a chore when I realized it contained a tinge of humor.
</li>
</ul>
</div>
</div>
