ruby/T.org
* [[https://wordsinasentence.com/tirade-in-a-sentence/][Tirade]]

  =a long and angry speech=

  - Because Carrie is normally a laidback person, she shocked everyone with her tirade.
  - The police arrested my Uncle Jack after he refused to end his tirade outside the courthouse.
  - When the airline representative told me my luggage was lost, I responded to the announcement with a tirade.
  - If my daughter does not get everything she wants for Christmas, she will launch a tirade.
  - The fan began his tirade by burning his jersey outside the football stadium.
  - Although the terrorist is in hiding, he recently held a press conference where he gave a tirade about his enemies.
  - The politician’s tirade against the proposed law lasted for nearly two hours.

* [[https://wordsinasentence.com/toil-in-a-sentence/][Toil]]

  =to work for a long period of time=

  - You should hire Justin because he is a hard worker who will toil until the job is done.
  - Day after day, the slaves had to toil in the hot fields without payment.
  - The actress had to toil for many years before becoming a Hollywood star.
  - In this country, illegal aliens often toil at jobs for very long hours for little pay.
  - People who toil in fast food kitchens often leave the workplace smelling of cooking oil and food products.
  - Because Janice is a single mother of four, she has to toil late in the evenings to earn enough money to buy food and clothing for her entire family.
  - My teenage daughter will not toil in the backyard if we do not offer her money for her landscaping labor.

* [[https://wordsinasentence.com/toll-in-a-sentence/][Toll]]

  =the number of casualties caused by an event that took lives=

  - The death toll from the tsunami was catastrophically high, reaching well into the tens of thousands across the coastline.
  - We can incur a lower death toll if we make a plan for the battle beforehand rather than charging in recklessly like a bunch of fools.
  - World War Two has the largest death toll of any war in all of human history, with millions of deaths on both sides of the conflict.
  - The toll for a war of any size is always higher than we think, as hundreds of thousands of people die in combat.

* [[https://wordsinasentence.com/tome-in-a-sentence/][Tome]]

  =a huge educational written work=

  - At the exhibit of the Templeton Historical Museum, it displayed a scene of a small room including a bed, chest and tome on the small desk.
  - A scholar referred to the tome when discussing and supporting his claim for artwork of the 1800s.
  - Instead of carrying the tome around the library, the young medical student decided to place it on a table and look it over.
  - At the law firm, the lawyer consulted the tome in the archives for information about his current case.


* [[https://wordsinasentence.com/torment-in-a-sentence/][Torment]]

  =to torture and cause pain=

  - Every day when he got on the bus, the bully began to torment the quiet child.
  - As the test date neared, haunting thoughts of failing her exam began to torment her mind.
  - Seeing his shyness as a weakness, the persecutor was apt to torment him day in and day out.
  - With the whip, the trainer set out to torment the tiger until he was tame.


* [[https://wordsinasentence.com/torrid-in-a-sentence/][Torrid]]

  =extremely sweltering and dry=

  - During these torrid temperatures, it is best we stay indoors and consume lots of fluids.
  - The firefighters had to prepare themselves physically and mentally for the torrid forest fire.
  - In the summer, the desert’s torrid climate makes it incredibly unpleasant for most people.
  - The torrid temperatures are sure to dry out the farmer’s crops.

* [[https://wordsinasentence.com/toss-in-a-sentence/][Toss]]

  =to throw something lightly or casually=

  - I didn’t want to break my phone, so I decided to toss it on my bed rather than throw it.
  - If you are playing catch with a young child, you should toss the ball at them instead of throw it do you do not hurt them if they get hit by it.
  - The reason it is called an egg toss and not an egg throw is because you must be gentle with an egg if you do not want to break it.
  - Your wife would be very angry if you threw your son in the air, which is why you toss them instead so they don’t go too far.

* [[https://wordsinasentence.com/totter-in-a-sentence/][Totter]]

  =to move with an unsteady or unsure gait or walk=

  - Disoriented, I had no choice but to totter towards the edge of the skating rink to grab a hold of the wall before I fell again.
  - Getting hit on the head by an apple, Isaac Newton would totter all the way back to his home, unable to walk in a straight line at all.
  - If you are drunk, you will probably totter to and fro as you walk, because you are too unsteady on your feet to move properly.
  - I was dizzy after spinning around in my swivel chair so much, and when it was time to get up I could only totter towards the door in an unsteady waltz.

* [[https://wordsinasentence.com/tract-in-a-sentence/][Tract]]

  =a large area or region=

  - Each tract of land is being sold at the price of 1,000 dollars per acre.
  - Part of the man’s digestive tract contained bacteria, but the rest of the area was clear.
  - My grandpa purchased a massive tract of land and hinted at the idea of a family farm.
  - Plans were not made for the entire tract, but some of the field will be used for a playground.

* [[https://wordsinasentence.com/traduce-in-a-sentence/][Traduce]]

  =to harm someone’s reputation by speaking of them in a negative manner=

  - The crooked politician paid a newspaper editor to traduce his rivals.
  - Because Gail and I are enemies, she tried to traduce me by telling my boyfriend lies.
  - Racists often quote negative stereotypes in an effort to traduce minority groups.
  - Since Mike wanted his parents to get back together, he went out of his way to traduce his father’s girlfriend.


* [[https://wordsinasentence.com/traipse-in-a-sentence/][Traipse]]

  =a leisurely and generally purposeless walk=

  - Every Sunday the voracious reader loved to traipse down several blocks to every independent bookstore without any intention of actually buying anything.
  - Because of her insomnia, she would often traipse around her house at night until she fell asleep or it was time to go to work.
  - Tourists traipse through downtown New York City taking in the bright lights and jaw-dropping sights.
  - The little girl loved to traipse around the house in her mother's high heels.

