ruby/T.html


<div id="outline-container-sec-92" class="outline-2">
<h2 id="sec-92"><span class="section-number-2">92</span> <a href="https://wordsinasentence.com/tirade-in-a-sentence/">Tirade</a></h2>
<div class="outline-text-2" id="text-92">
<p>
<code>a long and angry speech</code>
</p>

<ul class="org-ul">
<li>Because Carrie is normally a laidback person, she shocked everyone with her tirade.
</li>
<li>The police arrested my Uncle Jack after he refused to end his tirade outside the courthouse.
</li>
<li>When the airline representative told me my luggage was lost, I responded to the announcement with a tirade.
</li>
<li>If my daughter does not get everything she wants for Christmas, she will launch a tirade.
</li>
<li>The fan began his tirade by burning his jersey outside the football stadium.
</li>
<li>Although the terrorist is in hiding, he recently held a press conference where he gave a tirade about his enemies.
</li>
<li>The politician’s tirade against the proposed law lasted for nearly two hours.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-93" class="outline-2">
<h2 id="sec-93"><span class="section-number-2">93</span> <a href="https://wordsinasentence.com/toil-in-a-sentence/">Toil</a></h2>
<div class="outline-text-2" id="text-93">
<p>
<code>to work for a long period of time</code>
</p>

<ul class="org-ul">
<li>You should hire Justin because he is a hard worker who will toil until the job is done.
</li>
<li>Day after day, the slaves had to toil in the hot fields without payment.
</li>
<li>The actress had to toil for many years before becoming a Hollywood star.
</li>
<li>In this country, illegal aliens often toil at jobs for very long hours for little pay.
</li>
<li>People who toil in fast food kitchens often leave the workplace smelling of cooking oil and food products.
</li>
<li>Because Janice is a single mother of four, she has to toil late in the evenings to earn enough money to buy food and clothing for her entire family.
</li>
<li>My teenage daughter will not toil in the backyard if we do not offer her money for her landscaping labor.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-94" class="outline-2">
<h2 id="sec-94"><span class="section-number-2">94</span> <a href="https://wordsinasentence.com/toll-in-a-sentence/">Toll</a></h2>
<div class="outline-text-2" id="text-94">
<p>
<code>the number of casualties caused by an event that took lives</code>
</p>

<ul class="org-ul">
<li>The death toll from the tsunami was catastrophically high, reaching well into the tens of thousands across the coastline.
</li>
<li>We can incur a lower death toll if we make a plan for the battle beforehand rather than charging in recklessly like a bunch of fools.
</li>
<li>World War Two has the largest death toll of any war in all of human history, with millions of deaths on both sides of the conflict.
</li>
<li>The toll for a war of any size is always higher than we think, as hundreds of thousands of people die in combat.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-95" class="outline-2">
<h2 id="sec-95"><span class="section-number-2">95</span> <a href="https://wordsinasentence.com/tome-in-a-sentence/">Tome</a></h2>
<div class="outline-text-2" id="text-95">
<p>
<code>a huge educational written work</code>
</p>

<ul class="org-ul">
<li>At the exhibit of the Templeton Historical Museum, it displayed a scene of a small room including a bed, chest and tome on the small desk.
</li>
<li>A scholar referred to the tome when discussing and supporting his claim for artwork of the 1800s.
</li>
<li>Instead of carrying the tome around the library, the young medical student decided to place it on a table and look it over.
</li>
<li>At the law firm, the lawyer consulted the tome in the archives for information about his current case.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-96" class="outline-2">
<h2 id="sec-96"><span class="section-number-2">96</span> <a href="https://wordsinasentence.com/torment-in-a-sentence/">Torment</a></h2>
<div class="outline-text-2" id="text-96">
<p>
<code>to torture and cause pain</code>
</p>

<ul class="org-ul">
<li>Every day when he got on the bus, the bully began to torment the quiet child.
</li>
<li>As the test date neared, haunting thoughts of failing her exam began to torment her mind.
</li>
<li>Seeing his shyness as a weakness, the persecutor was apt to torment him day in and day out.
</li>
<li>With the whip, the trainer set out to torment the tiger until he was tame.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-97" class="outline-2">
<h2 id="sec-97"><span class="section-number-2">97</span> <a href="https://wordsinasentence.com/torrid-in-a-sentence/">Torrid</a></h2>
<div class="outline-text-2" id="text-97">
<p>
<code>extremely sweltering and dry</code>
</p>

<ul class="org-ul">
<li>During these torrid temperatures, it is best we stay indoors and consume lots of fluids.
</li>
<li>The firefighters had to prepare themselves physically and mentally for the torrid forest fire.
</li>
<li>In the summer, the desert’s torrid climate makes it incredibly unpleasant for most people.
</li>
<li>The torrid temperatures are sure to dry out the farmer’s crops.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-98" class="outline-2">
<h2 id="sec-98"><span class="section-number-2">98</span> <a href="https://wordsinasentence.com/toss-in-a-sentence/">Toss</a></h2>
<div class="outline-text-2" id="text-98">
<p>
<code>to throw something lightly or casually</code>
</p>

<ul class="org-ul">
<li>I didn’t want to break my phone, so I decided to toss it on my bed rather than throw it.
</li>
<li>If you are playing catch with a young child, you should toss the ball at them instead of throw it do you do not hurt them if they get hit by it.
</li>
<li>The reason it is called an egg toss and not an egg throw is because you must be gentle with an egg if you do not want to break it.
</li>
<li>Your wife would be very angry if you threw your son in the air, which is why you toss them instead so they don’t go too far.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-99" class="outline-2">
<h2 id="sec-99"><span class="section-number-2">99</span> <a href="https://wordsinasentence.com/totter-in-a-sentence/">Totter</a></h2>
<div class="outline-text-2" id="text-99">
<p>
<code>to move with an unsteady or unsure gait or walk</code>
</p>

<ul class="org-ul">
<li>Disoriented, I had no choice but to totter towards the edge of the skating rink to grab a hold of the wall before I fell again.
</li>
<li>Getting hit on the head by an apple, Isaac Newton would totter all the way back to his home, unable to walk in a straight line at all.
</li>
<li>If you are drunk, you will probably totter to and fro as you walk, because you are too unsteady on your feet to move properly.
</li>
<li>I was dizzy after spinning around in my swivel chair so much, and when it was time to get up I could only totter towards the door in an unsteady waltz.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-100" class="outline-2">
<h2 id="sec-100"><span class="section-number-2">100</span> <a href="https://wordsinasentence.com/tract-in-a-sentence/">Tract</a></h2>
<div class="outline-text-2" id="text-100">
<p>
<code>a large area or region</code>
</p>

<ul class="org-ul">
<li>Each tract of land is being sold at the price of 1,000 dollars per acre.
</li>
<li>Part of the man’s digestive tract contained bacteria, but the rest of the area was clear.
</li>
<li>My grandpa purchased a massive tract of land and hinted at the idea of a family farm.
</li>
<li>Plans were not made for the entire tract, but some of the field will be used for a playground.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-101" class="outline-2">
<h2 id="sec-101"><span class="section-number-2">101</span> <a href="https://wordsinasentence.com/traduce-in-a-sentence/">Traduce</a></h2>
<div class="outline-text-2" id="text-101">
<p>
<code>to harm someone’s reputation by speaking of them in a negative manner</code>
</p>

<ul class="org-ul">
<li>The crooked politician paid a newspaper editor to traduce his rivals.
</li>
<li>Because Gail and I are enemies, she tried to traduce me by telling my boyfriend lies.
</li>
<li>Racists often quote negative stereotypes in an effort to traduce minority groups.
</li>
<li>Since Mike wanted his parents to get back together, he went out of his way to traduce his father’s girlfriend.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-102" class="outline-2">
<h2 id="sec-102"><span class="section-number-2">102</span> <a href="https://wordsinasentence.com/traipse-in-a-sentence/">Traipse</a></h2>
<div class="outline-text-2" id="text-102">
<p>
<code>a leisurely and generally purposeless walk</code>
</p>

<ul class="org-ul">
<li>Every Sunday the voracious reader loved to traipse down several blocks to every independent bookstore without any intention of actually buying anything.
</li>
<li>Because of her insomnia, she would often traipse around her house at night until she fell asleep or it was time to go to work.
</li>
<li>Tourists traipse through downtown New York City taking in the bright lights and jaw-dropping sights.
</li>
<li>The little girl loved to traipse around the house in her mother's high heels.
</li>
</ul>
</div>
</div>
