ruby/T.org
* [[https://wordsinasentence.com/traitor-in-a-sentence/][Traitor]]

  =someone who betrays trust, alliance, or duty=

  - Judas is a notorious Biblical traitor.
  - When Lydia’s ex betrayed her trust by telling everyone her deepest secret, she had no choice but to dump the traitor.
  - The police apprehended the traitor to the throne and tried him for treason.
  - Ally turned traitor when he sold important government secrets to the highest bidder.

* [[https://wordsinasentence.com/tramp-in-a-sentence/][Tramp]]

  =a heavy-footed walk=

  - Angry children tramp noisily up the stairs, making sure to stomp out their irritation.
  - The Girl Scout failed her badge test because she chose to tramp loudly through the woods instead of searching for firewood.
  - The imaginative little boy loved to tramp through the house and pretend that his feet were made of cement blocks.
  - Agile spies never tramp, they are deadly silent as they walk.

* [[https://wordsinasentence.com/transfigure-in-a-sentence/][Transfigure]]

  =to fully change or transform into something different than the original form=

  - A group of wizards worked together to transfigure the fiery dragon into a meek mouse.
  - At the end of the book, the ugly duckling was able to transfigure himself into a beautiful swan.
  - The little dog was aggressive and could quickly disfigure any neat room into a nightmare.
  - A caterpillar can transfigure into a butterfly through a process called metamorphosis.

* [[https://wordsinasentence.com/transient-in-a-sentence/][Transient]]

  =lasting only for a short time; impermanent=

  - The snow is transient and will melt as soon as the sun appears.
  - If you are a transient person, you never remain in one place for too long.
  - The transient storm passed through our town rather quickly.
  - Because Jack and his wife relocate from city to city looking for work, they are considered to be a transient couple.
  - Unfortunately, my daughter seems to have only a transient interest in studying.
  - Sadly, Jamie realized his tattoo of his ex-girlfriend was permanent and not transient.
  - Fortunately the lack of water in the lake is only a transient issue.

* [[https://wordsinasentence.com/trapeze-in-a-sentence/][Trapeze]]

  =a gymnastic or acrobatic apparatus made of a short bar hanging high up in the air from two ropes=

  - Swinging from the trapeze, the acrobat did crowd wowing tricks as she dangled on the bar.
  - Trapeze artists are trained from childhood on how to spin and catch one another while hanging from their swing.
  - Being able to perform from on a low-flying trapeze is one of the main requirements of the gymnastic camp.
  - Using safety measures, the circus makes sure that acrobats swinging on the trapeze are not at risk of being injured during a fall.

* [[https://wordsinasentence.com/travesty-in-a-sentence/][Travesty]]

  =a false or distorted representation of something, usually of something serious=

  - It would be a travesty of justice to put an innocent man in jail.
  - Allowing students to cheat on tests is a travesty of education.
  - The real travesty is firing a man who did his job.
  - Kissing another person behind my back would be a travesty of our marriage!
  - What a pathetic travesty of justice for a policeman to harass a citizen!
  - As an accomplished singer, it would be a travesty for me to give a bad performance.
  - To hit a vehicle and speed off is a travesty on humanity.

* [[https://wordsinasentence.com/tremulous-in-a-sentence/][Tremulous]]

  =shaking or quivering=

  - Her voice was weak and tremulous, but the audience clapped politely when she finished the aria.
  - For a few moments Annie wasn’t sure that her tremulous fingers would be able to open the telegram.
  - Because her hands are too tremulous to hold a spoon steady, she has to drink soup from a cup.
  - Despite her efforts to stay in control of her emotions, her smile was tremulous as she waited to meet her long-lost brother.
  - Even though her knees were weak and her voice was tremulous, her message was powerful.
  - The last leaf of autumn made a valiant effort to hold on to the branch, finally giving up its tremulous hold and fluttering to the ground.
  - As head of the committee, I have been placed in a tremulous position to request more funding for the project.

* [[https://wordsinasentence.com/tribute-in-a-sentence/][Tribute]]

  =a way to honor a person=

  - The concert is a tribute to the men and women of the military who protect our nation.
  - On campus there is a statue of the school’s founder that stands as a tribute to the revered man.
  - The singer wrote the song as a tribute to his high school vocal coach.
  - As a tribute, Anne will fund a scholarship in her father's name.

* [[https://wordsinasentence.com/trifle-in-a-sentence/][Trifle]]

  =to handle with disrespect or in a discourteous manner=

  - When the cat catches the mouse, it will trifle with it before ending its life.
  - Jack was angered by his ex-wife’s attempt to trifle with him in front of their children.
  - Because Kate is a mean older sister, she will often trifle with her younger siblings and make them cry for no reason at all.
  - The sternly religious mother was shocked when she saw her child trifle with the Bible by writing in it.

* [[https://wordsinasentence.com/trinket-in-a-sentence/][Trinket]]

  =a small showy ornament or piece of jewelry=

  - Before returning from vacation, I purchased a cheap trinket for my daughter Robyn.
  - The fancy trinket glittered in Amber’s hair as she walked about in the open sun.
  - At the museum we were shown a trinket that was once owned by Lincoln, which he used as a piece of jewelry.
  - After the jeweler showed Grace the beautiful trinket she begged me to buy it for her.

* [[https://wordsinasentence.com/trivia-in-a-sentence/][Trivia]]

  =quiz game with little-known and unimportant facts=

  - I love to compete in trivia contests because I know so many random facts.
  - We whiled away our time, arguing over any meaningless trivia that caught our attention.
  - I keep a book of useless trivia information in every bathroom of my house.
  - Jerome likes to dazzle his friends with his vast knowledge of sports trivia from decades past.


