ruby/T.html

<div id="outline-container-sec-103" class="outline-2">
<h2 id="sec-103"><span class="section-number-2">103</span> <a href="https://wordsinasentence.com/traitor-in-a-sentence/">Traitor</a></h2>
<div class="outline-text-2" id="text-103">
<p>
<code>someone who betrays trust, alliance, or duty</code>
</p>

<ul class="org-ul">
<li>Judas is a notorious Biblical traitor.
</li>
<li>When Lydia’s ex betrayed her trust by telling everyone her deepest secret, she had no choice but to dump the traitor.
</li>
<li>The police apprehended the traitor to the throne and tried him for treason.
</li>
<li>Ally turned traitor when he sold important government secrets to the highest bidder.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-104" class="outline-2">
<h2 id="sec-104"><span class="section-number-2">104</span> <a href="https://wordsinasentence.com/tramp-in-a-sentence/">Tramp</a></h2>
<div class="outline-text-2" id="text-104">
<p>
<code>a heavy-footed walk</code>
</p>

<ul class="org-ul">
<li>Angry children tramp noisily up the stairs, making sure to stomp out their irritation.
</li>
<li>The Girl Scout failed her badge test because she chose to tramp loudly through the woods instead of searching for firewood.
</li>
<li>The imaginative little boy loved to tramp through the house and pretend that his feet were made of cement blocks.
</li>
<li>Agile spies never tramp, they are deadly silent as they walk.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-105" class="outline-2">
<h2 id="sec-105"><span class="section-number-2">105</span> <a href="https://wordsinasentence.com/transfigure-in-a-sentence/">Transfigure</a></h2>
<div class="outline-text-2" id="text-105">
<p>
<code>to fully change or transform into something different than the original form</code>
</p>

<ul class="org-ul">
<li>A group of wizards worked together to transfigure the fiery dragon into a meek mouse.
</li>
<li>At the end of the book, the ugly duckling was able to transfigure himself into a beautiful swan.
</li>
<li>The little dog was aggressive and could quickly disfigure any neat room into a nightmare.
</li>
<li>A caterpillar can transfigure into a butterfly through a process called metamorphosis.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-106" class="outline-2">
<h2 id="sec-106"><span class="section-number-2">106</span> <a href="https://wordsinasentence.com/transient-in-a-sentence/">Transient</a></h2>
<div class="outline-text-2" id="text-106">
<p>
<code>lasting only for a short time; impermanent</code>
</p>

<ul class="org-ul">
<li>The snow is transient and will melt as soon as the sun appears.
</li>
<li>If you are a transient person, you never remain in one place for too long.
</li>
<li>The transient storm passed through our town rather quickly.
</li>
<li>Because Jack and his wife relocate from city to city looking for work, they are considered to be a transient couple.
</li>
<li>Unfortunately, my daughter seems to have only a transient interest in studying.
</li>
<li>Sadly, Jamie realized his tattoo of his ex-girlfriend was permanent and not transient.
</li>
<li>Fortunately the lack of water in the lake is only a transient issue.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-107" class="outline-2">
<h2 id="sec-107"><span class="section-number-2">107</span> <a href="https://wordsinasentence.com/trapeze-in-a-sentence/">Trapeze</a></h2>
<div class="outline-text-2" id="text-107">
<p>
<code>a gymnastic or acrobatic apparatus made of a short bar hanging high up in the air from two ropes</code>
</p>

<ul class="org-ul">
<li>Swinging from the trapeze, the acrobat did crowd wowing tricks as she dangled on the bar.
</li>
<li>Trapeze artists are trained from childhood on how to spin and catch one another while hanging from their swing.
</li>
<li>Being able to perform from on a low-flying trapeze is one of the main requirements of the gymnastic camp.
</li>
<li>Using safety measures, the circus makes sure that acrobats swinging on the trapeze are not at risk of being injured during a fall.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-108" class="outline-2">
<h2 id="sec-108"><span class="section-number-2">108</span> <a href="https://wordsinasentence.com/travesty-in-a-sentence/">Travesty</a></h2>
<div class="outline-text-2" id="text-108">
<p>
<code>a false or distorted representation of something, usually of something serious</code>
</p>

<ul class="org-ul">
<li>It would be a travesty of justice to put an innocent man in jail.
</li>
<li>Allowing students to cheat on tests is a travesty of education.
</li>
<li>The real travesty is firing a man who did his job.
</li>
<li>Kissing another person behind my back would be a travesty of our marriage!
</li>
<li>What a pathetic travesty of justice for a policeman to harass a citizen!
</li>
<li>As an accomplished singer, it would be a travesty for me to give a bad performance.
</li>
<li>To hit a vehicle and speed off is a travesty on humanity.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-109" class="outline-2">
<h2 id="sec-109"><span class="section-number-2">109</span> <a href="https://wordsinasentence.com/tremulous-in-a-sentence/">Tremulous</a></h2>
<div class="outline-text-2" id="text-109">
<p>
<code>shaking or quivering</code>
</p>

<ul class="org-ul">
<li>Her voice was weak and tremulous, but the audience clapped politely when she finished the aria.
</li>
<li>For a few moments Annie wasn’t sure that her tremulous fingers would be able to open the telegram.
</li>
<li>Because her hands are too tremulous to hold a spoon steady, she has to drink soup from a cup.
</li>
<li>Despite her efforts to stay in control of her emotions, her smile was tremulous as she waited to meet her long-lost brother.
</li>
<li>Even though her knees were weak and her voice was tremulous, her message was powerful.
</li>
<li>The last leaf of autumn made a valiant effort to hold on to the branch, finally giving up its tremulous hold and fluttering to the ground.
</li>
<li>As head of the committee, I have been placed in a tremulous position to request more funding for the project.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-110" class="outline-2">
<h2 id="sec-110"><span class="section-number-2">110</span> <a href="https://wordsinasentence.com/tribute-in-a-sentence/">Tribute</a></h2>
<div class="outline-text-2" id="text-110">
<p>
<code>a way to honor a person</code>
</p>

<ul class="org-ul">
<li>The concert is a tribute to the men and women of the military who protect our nation.
</li>
<li>On campus there is a statue of the school’s founder that stands as a tribute to the revered man.
</li>
<li>The singer wrote the song as a tribute to his high school vocal coach.
</li>
<li>As a tribute, Anne will fund a scholarship in her father's name.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-111" class="outline-2">
<h2 id="sec-111"><span class="section-number-2">111</span> <a href="https://wordsinasentence.com/trifle-in-a-sentence/">Trifle</a></h2>
<div class="outline-text-2" id="text-111">
<p>
<code>to handle with disrespect or in a discourteous manner</code>
</p>

<ul class="org-ul">
<li>When the cat catches the mouse, it will trifle with it before ending its life.
</li>
<li>Jack was angered by his ex-wife’s attempt to trifle with him in front of their children.
</li>
<li>Because Kate is a mean older sister, she will often trifle with her younger siblings and make them cry for no reason at all.
</li>
<li>The sternly religious mother was shocked when she saw her child trifle with the Bible by writing in it.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-112" class="outline-2">
<h2 id="sec-112"><span class="section-number-2">112</span> <a href="https://wordsinasentence.com/trinket-in-a-sentence/">Trinket</a></h2>
<div class="outline-text-2" id="text-112">
<p>
<code>a small showy ornament or piece of jewelry</code>
</p>

<ul class="org-ul">
<li>Before returning from vacation, I purchased a cheap trinket for my daughter Robyn.
</li>
<li>The fancy trinket glittered in Amber’s hair as she walked about in the open sun.
</li>
<li>At the museum we were shown a trinket that was once owned by Lincoln, which he used as a piece of jewelry.
</li>
<li>After the jeweler showed Grace the beautiful trinket she begged me to buy it for her.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-113" class="outline-2">
<h2 id="sec-113"><span class="section-number-2">113</span> <a href="https://wordsinasentence.com/trivia-in-a-sentence/">Trivia</a></h2>
<div class="outline-text-2" id="text-113">
<p>
<code>quiz game with little-known and unimportant facts</code>
</p>

<ul class="org-ul">
<li>I love to compete in trivia contests because I know so many random facts.
</li>
<li>We whiled away our time, arguing over any meaningless trivia that caught our attention.
</li>
<li>I keep a book of useless trivia information in every bathroom of my house.
</li>
<li>Jerome likes to dazzle his friends with his vast knowledge of sports trivia from decades past.
</li>
</ul>
</div>
</div>
