ruby/T.org
* [[https://wordsinasentence.com/trounce-in-a-sentence/][Trounce]]

  =to severely defeat someone=

  - In the contest of strength, the full grown man managed to trounce his teenaged opponent with no effort whatsoever.
  - One army managed to easily trounce the other, being nearly ten times the size of the opposing force.
  - In a game of basketball, our team could easily trounce you guys, because we’ve been practicing all year for this.
  - My dad could easily trounce me in a contest of medical knowledge, but I could trounce him when it comes to literature.

* [[https://wordsinasentence.com/truant-in-a-sentence/][Truant]]

  =one who skips something important=

  - The truant hid in the park to avoid taking his midterm exams.
  - Since Gail is the office truant, she usually skips all of the mandatory office meetings.
  - The soldier who left base without permission is a truant who is always trying to avoid performing his duties.
  - Because my son was angry with his teachers, he decided he was going to be a truant and skip school all week.


* [[https://wordsinasentence.com/trudge-in-a-sentence/][Trudge]]

  =move forward slowly because of exhaustion=

  - Despite three days without food or rest, the weary soldiers continue to trudge over the battlefield.
  - Hoping to find help, the exhausted teens trudge through the woods.
  - Long before school buses were created, students would trudge for miles to get an education.
  - It was unsafe to drive during the ice storm so I had to trudge on foot to the store.



* [[https://wordsinasentence.com/trumpery-in-a-sentence/][Trumpery]]

  =something that is showy (looks good) but is really worthless=

  - The coins were trumpery, looking as if they were gold but were actually worthless.
  - The trumpery inside the trunk wasn’t valuable but it was good for decoration.
  - Putting on the gaudy necklace, the woman hoped that the trumpery would pass for real jewels.
  - Trumpery covered the antique shop, most of it showy and interesting looking but of no value.

* [[https://wordsinasentence.com/tumble-in-a-sentence/][Tumble]]

  =to fall down over and over again=

  - We installed a guard rail at the top of the steps to prevent the little boy from taking a tumble down two flights of stairs.
  - Jack began to tumble down the steep slope after he attempted to run up the side of a mountain to fetch a pail of water.
  - When the war broke out, stock prices took a tumble out of fear that the economy would suffer.
  - I knocked the intruder unconscious and tossed him over the railing and watched him tumble down the steps and out the front door.

* [[https://wordsinasentence.com/tumult-in-a-sentence/][Tumult]]

  =confusion or disorder=

  - While the political candidate’s popularity rating continues to fall, his office has declined into a state of tumult.
  - Economists are working to find solutions to the financial tumult that is ruining the lives of many Americans.
  - Since self-help books sell, it is highly likely the popular author will make a fortune with his autobiography describing his past emotional tumult and self-destructive habits.
  - On the brink of an internal war, the small country has never experienced such tumult in its one hundred year history.
  - After the country’s leader was assassinated, the nation endured tumult for several months.
  - Many refugees are seeking asylum because their native countries are being destroyed by political tumult.
  - Because of the tumult within the company’s management structure, many projects are not being completed on time.

* [[https://wordsinasentence.com/turgid-in-a-sentence/][Turgid]]

  =language that is complex and hard to understand=

  - The middle school student could not understand any of the facts listed in the turgid collegiate essay.
  - Even though the scientist tried to make his report simple, it was still too turgid for the average person to comprehend.
  - The movie’s plot was so turgid that people left the theater completely confused.
  - When the author wrote his novel, he had no idea it would be too turgid for his target audience to understand.
  - The uneducated man sought the services of legal aid to help him understand the turgid contract.
  - Although the critic tried repeatedly to make it through the turgid book, he was unable to finish the complex literary work.
  - Most of the company shareholders could not understand the turgid financial documents given out during the stockholder’s meeting.

* Tusk
  - Elephants wear the tusk down faster than they can grow it.
  - Wildlife advocacy groups say tens of thousands of African elephants are killed for their tusks each year.
  - Elephant tusks and ivory statues, carvings and chopsticks are still sold in Hong Kong’s antique stores.
  - Elephants can use their tusks as defensive weapons against potential predators like the tiger or in battle against other elephants.


* [[https://wordsinasentence.com/tweak-in-a-sentence/][Tweak]]

  =to adjust something to make it better=

  - Since the chef burned the brownies the last time she made them, she decided to tweak the recipe by only baking them for 20 minutes instead of 30 minutes.
  - When my car started making weird noises, the mechanic would tweak the car engine so that my car would run properly.
  - A greedy accountant decided to tweak the numbers in his log in order for the company to look like they made more money than it actually did.
  - After quickly writing her paper, the young college student wanted to tweak her essay by proofreading and editing it.

* [[https://wordsinasentence.com/twinge-in-a-sentence/][Twinge]]

  =a sudden, sharp localized pain=

  - After being tackled by several 300 pound football players, the quarterback felt a twinge in his ribs that made him think he broke a few bones.
  - The elderly man felt a sharp twinge in his chest right before he had a heart attack.
  - John’s terrible migraines always started with a piercing twinge in his head followed by a pounding headache.
  - She felt a twinge in her chest every time she saw her first love and remembered all of the wonderful times they had together.

