ruby/T.html


<div id="outline-container-sec-114" class="outline-2">
<h2 id="sec-114"><span class="section-number-2">114</span> <a href="https://wordsinasentence.com/trounce-in-a-sentence/">Trounce</a></h2>
<div class="outline-text-2" id="text-114">
<p>
<code>to severely defeat someone</code>
</p>

<ul class="org-ul">
<li>In the contest of strength, the full grown man managed to trounce his teenaged opponent with no effort whatsoever.
</li>
<li>One army managed to easily trounce the other, being nearly ten times the size of the opposing force.
</li>
<li>In a game of basketball, our team could easily trounce you guys, because we’ve been practicing all year for this.
</li>
<li>My dad could easily trounce me in a contest of medical knowledge, but I could trounce him when it comes to literature.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-115" class="outline-2">
<h2 id="sec-115"><span class="section-number-2">115</span> <a href="https://wordsinasentence.com/truant-in-a-sentence/">Truant</a></h2>
<div class="outline-text-2" id="text-115">
<p>
<code>one who skips something important</code>
</p>

<ul class="org-ul">
<li>The truant hid in the park to avoid taking his midterm exams.
</li>
<li>Since Gail is the office truant, she usually skips all of the mandatory office meetings.
</li>
<li>The soldier who left base without permission is a truant who is always trying to avoid performing his duties.
</li>
<li>Because my son was angry with his teachers, he decided he was going to be a truant and skip school all week.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-116" class="outline-2">
<h2 id="sec-116"><span class="section-number-2">116</span> <a href="https://wordsinasentence.com/trudge-in-a-sentence/">Trudge</a></h2>
<div class="outline-text-2" id="text-116">
<p>
<code>move forward slowly because of exhaustion</code>
</p>

<ul class="org-ul">
<li>Despite three days without food or rest, the weary soldiers continue to trudge over the battlefield.
</li>
<li>Hoping to find help, the exhausted teens trudge through the woods.
</li>
<li>Long before school buses were created, students would trudge for miles to get an education.
</li>
<li>It was unsafe to drive during the ice storm so I had to trudge on foot to the store.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-117" class="outline-2">
<h2 id="sec-117"><span class="section-number-2">117</span> <a href="https://wordsinasentence.com/trumpery-in-a-sentence/">Trumpery</a></h2>
<div class="outline-text-2" id="text-117">
<p>
<code>something that is showy (looks good) but is really worthless</code>
</p>

<ul class="org-ul">
<li>The coins were trumpery, looking as if they were gold but were actually worthless.
</li>
<li>The trumpery inside the trunk wasn’t valuable but it was good for decoration.
</li>
<li>Putting on the gaudy necklace, the woman hoped that the trumpery would pass for real jewels.
</li>
<li>Trumpery covered the antique shop, most of it showy and interesting looking but of no value.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-118" class="outline-2">
<h2 id="sec-118"><span class="section-number-2">118</span> <a href="https://wordsinasentence.com/tumble-in-a-sentence/">Tumble</a></h2>
<div class="outline-text-2" id="text-118">
<p>
<code>to fall down over and over again</code>
</p>

<ul class="org-ul">
<li>We installed a guard rail at the top of the steps to prevent the little boy from taking a tumble down two flights of stairs.
</li>
<li>Jack began to tumble down the steep slope after he attempted to run up the side of a mountain to fetch a pail of water.
</li>
<li>When the war broke out, stock prices took a tumble out of fear that the economy would suffer.
</li>
<li>I knocked the intruder unconscious and tossed him over the railing and watched him tumble down the steps and out the front door.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-119" class="outline-2">
<h2 id="sec-119"><span class="section-number-2">119</span> <a href="https://wordsinasentence.com/tumult-in-a-sentence/">Tumult</a></h2>
<div class="outline-text-2" id="text-119">
<p>
<code>confusion or disorder</code>
</p>

<ul class="org-ul">
<li>While the political candidate’s popularity rating continues to fall, his office has declined into a state of tumult.
</li>
<li>Economists are working to find solutions to the financial tumult that is ruining the lives of many Americans.
</li>
<li>Since self-help books sell, it is highly likely the popular author will make a fortune with his autobiography describing his past emotional tumult and self-destructive habits.
</li>
<li>On the brink of an internal war, the small country has never experienced such tumult in its one hundred year history.
</li>
<li>After the country’s leader was assassinated, the nation endured tumult for several months.
</li>
<li>Many refugees are seeking asylum because their native countries are being destroyed by political tumult.
</li>
<li>Because of the tumult within the company’s management structure, many projects are not being completed on time.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-120" class="outline-2">
<h2 id="sec-120"><span class="section-number-2">120</span> <a href="https://wordsinasentence.com/turgid-in-a-sentence/">Turgid</a></h2>
<div class="outline-text-2" id="text-120">
<p>
<code>language that is complex and hard to understand</code>
</p>

<ul class="org-ul">
<li>The middle school student could not understand any of the facts listed in the turgid collegiate essay.
</li>
<li>Even though the scientist tried to make his report simple, it was still too turgid for the average person to comprehend.
</li>
<li>The movie’s plot was so turgid that people left the theater completely confused.
</li>
<li>When the author wrote his novel, he had no idea it would be too turgid for his target audience to understand.
</li>
<li>The uneducated man sought the services of legal aid to help him understand the turgid contract.
</li>
<li>Although the critic tried repeatedly to make it through the turgid book, he was unable to finish the complex literary work.
</li>
<li>Most of the company shareholders could not understand the turgid financial documents given out during the stockholder’s meeting.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-121" class="outline-2">
<h2 id="sec-121"><span class="section-number-2">121</span> Tusk</h2>
<div class="outline-text-2" id="text-121">
<ul class="org-ul">
<li>Elephants wear the tusk down faster than they can grow it.
</li>
<li>Wildlife advocacy groups say tens of thousands of African elephants are killed for their tusks each year.
</li>
<li>Elephant tusks and ivory statues, carvings and chopsticks are still sold in Hong Kong’s antique stores.
</li>
<li>Elephants can use their tusks as defensive weapons against potential predators like the tiger or in battle against other elephants.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-122" class="outline-2">
<h2 id="sec-122"><span class="section-number-2">122</span> <a href="https://wordsinasentence.com/tweak-in-a-sentence/">Tweak</a></h2>
<div class="outline-text-2" id="text-122">
<p>
<code>to adjust something to make it better</code>
</p>

<ul class="org-ul">
<li>Since the chef burned the brownies the last time she made them, she decided to tweak the recipe by only baking them for 20 minutes instead of 30 minutes.
</li>
<li>When my car started making weird noises, the mechanic would tweak the car engine so that my car would run properly.
</li>
<li>A greedy accountant decided to tweak the numbers in his log in order for the company to look like they made more money than it actually did.
</li>
<li>After quickly writing her paper, the young college student wanted to tweak her essay by proofreading and editing it.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-123" class="outline-2">
<h2 id="sec-123"><span class="section-number-2">123</span> <a href="https://wordsinasentence.com/twinge-in-a-sentence/">Twinge</a></h2>
<div class="outline-text-2" id="text-123">
<p>
<code>a sudden, sharp localized pain</code>
</p>

<ul class="org-ul">
<li>After being tackled by several 300 pound football players, the quarterback felt a twinge in his ribs that made him think he broke a few bones.
</li>
<li>The elderly man felt a sharp twinge in his chest right before he had a heart attack.
</li>
<li>John’s terrible migraines always started with a piercing twinge in his head followed by a pounding headache.
</li>
<li>She felt a twinge in her chest every time she saw her first love and remembered all of the wonderful times they had together.
</li>
</ul>
</div>
</div>
